{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 184,
   "metadata": {},
   "outputs": [],
   "source": [
    "import boto3\n",
    "import networkx as nx\n",
    "import time\n",
    "from py2neo import Graph, Node, Relationship\n",
    "import community\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Lets download the data first."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [],
   "source": [
    "session = boto3.Session(\n",
    "    aws_access_key_id='AKIAJA5TRUVIP2L4FSOA',\n",
    "    aws_secret_access_key='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',\n",
    "    region_name='eu-central-1'\n",
    ")\n",
    "s3_client_epfl = session.client(\"s3\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "metadata": {},
   "outputs": [],
   "source": [
    "bucket = 'somed.networks'\n",
    "key = 'test.gexf'\n",
    "\n",
    "with open('data.nx', 'wb') as data_file:\n",
    "        s3_client_epfl.download_fileobj(bucket, key, data_file) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Lets read data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "metadata": {},
   "outputs": [],
   "source": [
    "G = nx.read_gexf('data.nx')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Delete everything before add something"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"http://neo4j:qqwweerr@localhost:7474/db/data/\")\n",
    "\n",
    "# graph.delete_all() # Be carefull"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "nodes = {}\n",
    "edges = {}\n",
    "\n",
    "root_partition = Node(\"Community\", name=str(0), optainedBy=\"Root\", timestamp=str(time.time()))\n",
    "graph.create(root_partition)\n",
    "\n",
    "for node in G.nodes():\n",
    "    nodes[node] = Node(\"Instauser\", name=str(node))\n",
    "    graph.create(nodes[node])\n",
    "    \n",
    "for source, target in G.edges():\n",
    "    edges[str(source) + str(target)] = Relationship(nodes[str(source)], \"LIKES\", nodes[str(target)])\n",
    "    graph.create(edges[str(source) + str(target)])\n",
    "    \n",
    "\n",
    "for _, node in nodes.items():\n",
    "    root_community_edge = Relationship(node, \"MEMBER_OF\", root_partition)\n",
    "    graph.create(root_community_edge)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create Order Node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\" \n",
    "MATCH (a:Order) RETURN MAX(a.name) AS m\n",
    "    \"\"\"\n",
    "\n",
    "max_result = graph.run(query).data()[0]\n",
    "max_order = int(float(max_result['m'])) + 1 if max_result['m'] else 0\n",
    "\n",
    "order_node = Node(\"Order\", name=str(max_order), optainedBy=\"Louvain\", timestamp=str(time.time()))\n",
    "graph.create(order_node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'r': (0)-[:SUB_COMMUNITY_OF {}]->(0)}]"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "        MATCH (a:Community),(b:Order)\n",
    "        WHERE a.name = '{}' AND b.name = '{}'\n",
    "        CREATE (a)-[r:SUB_COMMUNITY_OF]->(b)\n",
    "        RETURN r\n",
    "    \"\"\".format(\"0\", \"0\")\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create community nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "partitions = community.best_partition(G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'3934946894': 1,\n",
       " '4230604813': 2,\n",
       " '174644238': 3,\n",
       " '964190736': 1,\n",
       " '26613266': 3,\n",
       " '1165208595': 3,\n",
       " '5698811419': 1,\n",
       " '5897207838': 1,\n",
       " '5869957667': 4,\n",
       " '3244036142': 5,\n",
       " '3993411126': 1,\n",
       " '200215607': 6,\n",
       " '2160086594': 3,\n",
       " '179748419': 1,\n",
       " '5551530569': 1,\n",
       " '5971046986': 3,\n",
       " '174089804': 1,\n",
       " '19520601': 1,\n",
       " '195734630': 1,\n",
       " '3666044013': 2,\n",
       " '3155481714': 6,\n",
       " '269351546': 1,\n",
       " '240518274': 3,\n",
       " '4791608452': 7,\n",
       " '4041773700': 1,\n",
       " '5695384717': 1,\n",
       " '6003347087': 2,\n",
       " '1942468756': 8,\n",
       " '4111757972': 1,\n",
       " '365822104': 9,\n",
       " '5207543968': 1,\n",
       " '1605548706': 1,\n",
       " '225870512': 1,\n",
       " '1598824113': 1,\n",
       " '9800370': 1,\n",
       " '5823585976': 3,\n",
       " '1962759868': 1,\n",
       " '3150935741': 1,\n",
       " '5912606913': 3,\n",
       " '222219972': 1,\n",
       " '5844123847': 1,\n",
       " '33864905': 1,\n",
       " '4140014299': 1,\n",
       " '4175255771': 10,\n",
       " '4175570144': 3,\n",
       " '2895420648': 3,\n",
       " '5981342956': 3,\n",
       " '4197170416': 1,\n",
       " '2179036407': 3,\n",
       " '5503459066': 1,\n",
       " '5521227517': 1,\n",
       " '1550128894': 1,\n",
       " '5959393044': 1,\n",
       " '235886891': 3,\n",
       " '3098844472': 1,\n",
       " '6345238331': 11,\n",
       " '3565345596': 1,\n",
       " '183715133': 1,\n",
       " '3316168524': 3,\n",
       " '2297825111': 1,\n",
       " '3270229338': 3,\n",
       " '1466519394': 3,\n",
       " '2888550': 3,\n",
       " '184039281': 1,\n",
       " '1785609586': 3,\n",
       " '418103158': 1,\n",
       " '48353153': 1,\n",
       " '567986052': 1,\n",
       " '4697723782': 6,\n",
       " '2000332172': 3,\n",
       " '2519484817': 10,\n",
       " '3233675160': 3,\n",
       " '287450010': 1,\n",
       " '4178945948': 3,\n",
       " '3494104989': 3,\n",
       " '4087396254': 1,\n",
       " '15612836': 3,\n",
       " '5820610994': 12,\n",
       " '2219916744': 1,\n",
       " '8126408': 3,\n",
       " '1477140432': 12,\n",
       " '28027885': 5,\n",
       " '495726579': 1,\n",
       " '2010378230': 1,\n",
       " '2031084023': 3,\n",
       " '3169050616': 3,\n",
       " '514563397': 2,\n",
       " '180232412': 3,\n",
       " '179046170': 1,\n",
       " '4176061394': 3,\n",
       " '1148688035': 11,\n",
       " '2290489168': 3,\n",
       " '2106215713': 13,\n",
       " '576646295': 10,\n",
       " '21701557': 3,\n",
       " '4267063598': 3,\n",
       " '216802064': 14,\n",
       " '248966742': 3,\n",
       " '179674828': 3,\n",
       " '1082579': 3,\n",
       " '4549962994': 3,\n",
       " '2935842710': 1,\n",
       " '1621229824': 15,\n",
       " '1438900879': 1,\n",
       " '21944101': 9,\n",
       " '1434581753': 1,\n",
       " '1372615': 5,\n",
       " '3467174123': 3,\n",
       " '299853862': 10,\n",
       " '215389991': 3,\n",
       " '1901852384': 3,\n",
       " '6681069935': 3,\n",
       " '4357981756': 3,\n",
       " '1714348141': 3,\n",
       " '204604353': 16,\n",
       " '30267593': 3,\n",
       " '1435956629': 15,\n",
       " '6001117': 10,\n",
       " '2223081174': 3,\n",
       " '4251137497': 3,\n",
       " '1903116195': 3,\n",
       " '874294559': 1,\n",
       " '6215158476': 3,\n",
       " '2168659671': 3,\n",
       " '2358075593': 3,\n",
       " '385517618': 3,\n",
       " '23892074': 14,\n",
       " '3064760620': 1,\n",
       " '6274548619': 15,\n",
       " '2020475721': 5,\n",
       " '5835326148': 3,\n",
       " '2955155': 3,\n",
       " '248158977': 17,\n",
       " '26696131': 3,\n",
       " '146188250': 3,\n",
       " '6344328800': 3,\n",
       " '1088853708': 7,\n",
       " '4783160536': 3,\n",
       " '593438352': 3,\n",
       " '287941292': 3,\n",
       " '188928796': 17,\n",
       " '24102401': 3,\n",
       " '232681400': 3,\n",
       " '223417243': 18,\n",
       " '267471622': 16,\n",
       " '30300717': 3,\n",
       " '241055075': 15,\n",
       " '484662508': 19,\n",
       " '5687089009': 3,\n",
       " '26095874': 19,\n",
       " '3537607644': 19,\n",
       " '520313851': 3,\n",
       " '22306594': 20,\n",
       " '516211278': 20,\n",
       " '254195225': 15,\n",
       " '4317836140': 3,\n",
       " '1592126461': 3,\n",
       " '6653641291': 11,\n",
       " '3242840377': 3,\n",
       " '279861922': 3,\n",
       " '12153894': 20,\n",
       " '1497105595': 3,\n",
       " '312424350': 20,\n",
       " '645395727': 3,\n",
       " '501041083': 1,\n",
       " '1058110112': 5,\n",
       " '1352253289': 21,\n",
       " '667419698': 3,\n",
       " '5998078112': 15,\n",
       " '833212899': 20,\n",
       " '15888820': 8,\n",
       " '21137778': 3,\n",
       " '36040760': 3,\n",
       " '544414267': 3,\n",
       " '4078330356': 1,\n",
       " '260682849': 20,\n",
       " '616139812': 3,\n",
       " '5689260657': 2,\n",
       " '293117712': 3,\n",
       " '6109762900': 18,\n",
       " '226670567': 3,\n",
       " '572331627': 11,\n",
       " '8022712': 20,\n",
       " '27130999': 7,\n",
       " '10763916': 15,\n",
       " '5452219719': 3,\n",
       " '20128743': 2,\n",
       " '1803697881': 3,\n",
       " '443412570': 3,\n",
       " '325542322': 7,\n",
       " '3077709591': 3,\n",
       " '247403319': 19,\n",
       " '3922594085': 1,\n",
       " '6064518039': 1,\n",
       " '5894405550': 3,\n",
       " '1473554270': 1,\n",
       " '586429775': 3,\n",
       " '8706123': 1,\n",
       " '45905334': 1,\n",
       " '392646900': 20,\n",
       " '29726463': 1,\n",
       " '7000215': 20,\n",
       " '1549176469': 3,\n",
       " '509243045': 3,\n",
       " '994569431': 3,\n",
       " '2884111258': 3,\n",
       " '4126703041': 3,\n",
       " '605356465': 18,\n",
       " '3238452178': 3,\n",
       " '6293052862': 3,\n",
       " '1822640728': 3,\n",
       " '300081496': 2,\n",
       " '4022386921': 3,\n",
       " '5878368681': 3,\n",
       " '3339593': 15,\n",
       " '1264193341': 6,\n",
       " '3159457274': 3,\n",
       " '3030964677': 3,\n",
       " '1413574577': 3,\n",
       " '413966600': 3,\n",
       " '52460547': 16,\n",
       " '3797062046': 20,\n",
       " '230679481': 3,\n",
       " '8332795': 3,\n",
       " '208343105': 1,\n",
       " '3273018912': 13,\n",
       " '6229116804': 8,\n",
       " '3494314620': 15,\n",
       " '36373540': 11,\n",
       " '1213863357': 1,\n",
       " '321948069': 3,\n",
       " '267265644': 3,\n",
       " '12910798': 3,\n",
       " '273432248': 18,\n",
       " '1017349': 3,\n",
       " '2382069': 1,\n",
       " '4980365318': 3,\n",
       " '1284926018': 3,\n",
       " '4371011275': 15,\n",
       " '478707726': 15,\n",
       " '1145612351': 15,\n",
       " '1067474596': 3,\n",
       " '385755853': 22,\n",
       " '3271016848': 20,\n",
       " '1765336794': 3,\n",
       " '50675368': 3,\n",
       " '3041668335': 1,\n",
       " '1774840149': 1,\n",
       " '260538037': 3,\n",
       " '256751191': 3,\n",
       " '4973949': 6,\n",
       " '5373259200': 3,\n",
       " '186382614': 15,\n",
       " '1639936926': 8,\n",
       " '361614659': 1,\n",
       " '3697427': 3,\n",
       " '269402371': 23,\n",
       " '5702835311': 3,\n",
       " '202775785': 3,\n",
       " '245651928': 3,\n",
       " '19521217': 20,\n",
       " '21294919': 3,\n",
       " '1978264264': 3,\n",
       " '1434753325': 1,\n",
       " '1389066358': 3,\n",
       " '7427792': 3,\n",
       " '242500155': 3,\n",
       " '1454104140': 15,\n",
       " '1918118502': 3,\n",
       " '3075973833': 3,\n",
       " '4121459758': 3,\n",
       " '6284151483': 20,\n",
       " '1671937718': 3,\n",
       " '32654633': 20,\n",
       " '203433907': 3,\n",
       " '4176873099': 3,\n",
       " '53126551': 22,\n",
       " '4211836699': 20,\n",
       " '232474910': 2,\n",
       " '20046354': 1,\n",
       " '3165216239': 1,\n",
       " '3786700052': 1,\n",
       " '190276210': 3,\n",
       " '10827472': 3,\n",
       " '1547524380': 3,\n",
       " '18321726': 1,\n",
       " '30543995': 3,\n",
       " '563890495': 1,\n",
       " '4646383480': 8,\n",
       " '308801506': 3,\n",
       " '184106429': 5,\n",
       " '3970819079': 3,\n",
       " '2197833744': 3,\n",
       " '2374630650': 11,\n",
       " '4651626725': 20,\n",
       " '3302662': 6,\n",
       " '247643050': 6,\n",
       " '10006516': 3,\n",
       " '620245485': 3,\n",
       " '2256616452': 18,\n",
       " '191253546': 15,\n",
       " '5709269759': 3,\n",
       " '1657974345': 3,\n",
       " '5481428825': 1,\n",
       " '569944258': 20,\n",
       " '1412836231': 1,\n",
       " '280742189': 2,\n",
       " '27528432': 16,\n",
       " '1538524058': 16,\n",
       " '1362222525': 1,\n",
       " '1668430946': 1,\n",
       " '4708714124': 20,\n",
       " '50654006': 3,\n",
       " '3817329867': 3,\n",
       " '27476126': 6,\n",
       " '1402995804': 1,\n",
       " '3965609558': 4,\n",
       " '49005740': 1,\n",
       " '191831882': 5,\n",
       " '34688026': 5,\n",
       " '182957431': 6,\n",
       " '1671345795': 24,\n",
       " '2032443413': 3,\n",
       " '6019584159': 3,\n",
       " '27051867': 3,\n",
       " '1687529339': 1,\n",
       " '6156498867': 3,\n",
       " '3418475102': 13,\n",
       " '18115599': 10,\n",
       " '9077564': 1,\n",
       " '186847283': 5,\n",
       " '16618340': 6,\n",
       " '249001192': 14,\n",
       " '2285050274': 1,\n",
       " '5345387909': 20,\n",
       " '1098219395': 3,\n",
       " '563174364': 1,\n",
       " '4943126319': 3,\n",
       " '5324633532': 3,\n",
       " '2923563245': 11,\n",
       " '5377383050': 3,\n",
       " '21073842': 1,\n",
       " '2021477055': 1,\n",
       " '217984476': 21,\n",
       " '217987366': 21,\n",
       " '335399208': 15,\n",
       " '5656922417': 9,\n",
       " '249081804': 6,\n",
       " '10600702': 15,\n",
       " '316342407': 3,\n",
       " '393196661': 3,\n",
       " '4701216618': 3,\n",
       " '4282303298': 3,\n",
       " '25844058': 1,\n",
       " '1624284281': 15,\n",
       " '2182421035': 3,\n",
       " '931446656': 1,\n",
       " '2978827196': 7,\n",
       " '5754827059': 17,\n",
       " '2166421': 20,\n",
       " '645580537': 3,\n",
       " '1438356529': 5,\n",
       " '180046608': 16,\n",
       " '4024050782': 20,\n",
       " '1947621764': 5,\n",
       " '5309904310': 1,\n",
       " '1478737468': 3,\n",
       " '424752035': 11,\n",
       " '3273649203': 3,\n",
       " '394905277': 25,\n",
       " '1388280780': 2,\n",
       " '1533010882': 1,\n",
       " '187287702': 7,\n",
       " '4119866622': 7,\n",
       " '299162365': 3,\n",
       " '1367210665': 20,\n",
       " '1269666801': 19,\n",
       " '228629230': 15,\n",
       " '5356803631': 15,\n",
       " '277231157': 3,\n",
       " '41358964': 2,\n",
       " '46613747': 20,\n",
       " '208237879': 19,\n",
       " '4747605': 20,\n",
       " '181780912': 9,\n",
       " '6175005041': 5,\n",
       " '327500626': 1,\n",
       " '314005930': 5,\n",
       " '1688876491': 2,\n",
       " '1193164151': 20,\n",
       " '6502761420': 7,\n",
       " '3681723336': 4,\n",
       " '5573008866': 12,\n",
       " '664272893': 6,\n",
       " '751829132': 8,\n",
       " '8627519': 15,\n",
       " '2053866313': 15,\n",
       " '798582599': 8,\n",
       " '2304724460': 1,\n",
       " '6424210419': 2,\n",
       " '1513245804': 1,\n",
       " '356405755': 15,\n",
       " '369174070': 2,\n",
       " '256001852': 20,\n",
       " '205807404': 3,\n",
       " '326817529': 5,\n",
       " '301152290': 9,\n",
       " '46817235': 1,\n",
       " '2323869216': 19,\n",
       " '292146084': 15,\n",
       " '1808503': 3,\n",
       " '261819113': 3,\n",
       " '247096908': 3,\n",
       " '1592830482': 5,\n",
       " '236752227': 6,\n",
       " '1267130201': 3,\n",
       " '2372185170': 10,\n",
       " '28550688': 3,\n",
       " '2941956041': 1,\n",
       " '3069735413': 5,\n",
       " '4667506415': 3,\n",
       " '5998122026': 5,\n",
       " '190503793': 2,\n",
       " '2457389294': 10,\n",
       " '1996724786': 3,\n",
       " '2306026954': 5,\n",
       " '348390354': 11,\n",
       " '218762100': 11,\n",
       " '260514674': 3,\n",
       " '697070003': 8,\n",
       " '4865182701': 7,\n",
       " '288287844': 2,\n",
       " '1446248071': 8,\n",
       " '3826251040': 3,\n",
       " '4787003648': 1,\n",
       " '231291097': 9,\n",
       " '28074241': 24,\n",
       " '21478963': 15,\n",
       " '6191415789': 17,\n",
       " '5835654040': 1,\n",
       " '3639963873': 3,\n",
       " '368338309': 22,\n",
       " '273025204': 2,\n",
       " '210752730': 11,\n",
       " '719126554': 11,\n",
       " '5609133211': 3,\n",
       " '988614239': 11,\n",
       " '203250357': 15,\n",
       " '235512345': 15,\n",
       " '1711634371': 3,\n",
       " '4076427613': 3,\n",
       " '44697202': 3,\n",
       " '261430853': 3,\n",
       " '4215670355': 1,\n",
       " '49896139': 10,\n",
       " '3180498348': 5,\n",
       " '22969622': 1,\n",
       " '2991450862': 1,\n",
       " '2073914956': 3,\n",
       " '4282639845': 3,\n",
       " '4038125334': 7,\n",
       " '1336916340': 6,\n",
       " '36192544': 9,\n",
       " '215135938': 3,\n",
       " '185676986': 1,\n",
       " '1459466500': 15,\n",
       " '3880303970': 3,\n",
       " '2315935497': 15,\n",
       " '2018199124': 15,\n",
       " '144072519': 15,\n",
       " '1646944783': 15,\n",
       " '30647833': 15,\n",
       " '30787579': 20,\n",
       " '6208202863': 3,\n",
       " '425958346': 9,\n",
       " '1286445729': 9,\n",
       " '5533635224': 9,\n",
       " '338481447': 15,\n",
       " '260394556': 15,\n",
       " '1399484649': 5,\n",
       " '174350068': 26,\n",
       " '3841408634': 5,\n",
       " '1263840307': 3,\n",
       " '3290419312': 3,\n",
       " '3681792014': 3,\n",
       " '919110649': 20,\n",
       " '3946025902': 3,\n",
       " '509837977': 1,\n",
       " '221153814': 16,\n",
       " '6123992717': 3,\n",
       " '6026460602': 5,\n",
       " '254103456': 5,\n",
       " '1800287360': 5,\n",
       " '13135911': 3,\n",
       " '1122941910': 3,\n",
       " '347685013': 3,\n",
       " '3180220253': 20,\n",
       " '2172390338': 3,\n",
       " '1524392236': 2,\n",
       " '10847580': 5,\n",
       " '6430151015': 5,\n",
       " '1472885285': 9,\n",
       " '1808976609': 5,\n",
       " '4274655426': 3,\n",
       " '2015104312': 11,\n",
       " '369540386': 3,\n",
       " '54129645': 16,\n",
       " '4850389360': 20,\n",
       " '5769846097': 1,\n",
       " '2139870205': 24,\n",
       " '5323136': 20,\n",
       " '338260218': 3,\n",
       " '48719931': 16,\n",
       " '252044589': 9,\n",
       " '1563574838': 3,\n",
       " '738283562': 21,\n",
       " '4318404533': 17,\n",
       " '2133918012': 3,\n",
       " '28303342': 15,\n",
       " '206048629': 3,\n",
       " '51529689': 17,\n",
       " '26909445': 6,\n",
       " '20291444': 20,\n",
       " '2110776': 17,\n",
       " '1647728745': 1,\n",
       " '3562599484': 15,\n",
       " '42017363': 1,\n",
       " '10716139': 21,\n",
       " '198838006': 6,\n",
       " '281586948': 1,\n",
       " '27927875': 1,\n",
       " '5486274464': 1,\n",
       " '16071072': 13,\n",
       " '2118522204': 20,\n",
       " '1832130224': 17,\n",
       " '2110046240': 1,\n",
       " '5651087079': 22,\n",
       " '181320576': 15,\n",
       " '372826044': 3,\n",
       " '55336649': 9,\n",
       " '4092799256': 3,\n",
       " '16371891': 10,\n",
       " '2415121007': 7,\n",
       " '5706854620': 3,\n",
       " '1548037533': 20,\n",
       " '1040579163': 21,\n",
       " '4078049902': 5,\n",
       " '8398964': 3,\n",
       " '525154164': 3,\n",
       " '1602102237': 13,\n",
       " '834416160': 3,\n",
       " '609791278': 3,\n",
       " '908928723': 16,\n",
       " '236677439': 5,\n",
       " '18489940': 5,\n",
       " '787440': 1,\n",
       " '1800389606': 10,\n",
       " '281577676': 6,\n",
       " '275955651': 9,\n",
       " '3874605713': 3,\n",
       " '235323470': 10,\n",
       " '4297944376': 10,\n",
       " '726404': 1,\n",
       " '1537486573': 10,\n",
       " '4406801': 26,\n",
       " '2405038247': 5,\n",
       " '53672579': 7,\n",
       " '1549748689': 5,\n",
       " '2800214831': 9,\n",
       " '8612307': 3,\n",
       " '319273303': 5,\n",
       " '1791353719': 16,\n",
       " '2199341996': 12,\n",
       " '280625470': 11,\n",
       " '4141881': 15,\n",
       " '8140390': 5,\n",
       " '145520603': 20,\n",
       " '2369018813': 23,\n",
       " '4524111178': 5,\n",
       " '368554936': 5,\n",
       " '2225983430': 11,\n",
       " '550582470': 11,\n",
       " '5038472867': 15,\n",
       " '192193355': 9,\n",
       " '546313503': 3,\n",
       " '4116478016': 3,\n",
       " '308627208': 3,\n",
       " '2379866657': 3,\n",
       " '2759691616': 3,\n",
       " '184341232': 15,\n",
       " '737424602': 15,\n",
       " '4244089317': 5,\n",
       " '899621': 8,\n",
       " '173716360': 2,\n",
       " '321714391': 19,\n",
       " '1415029645': 19,\n",
       " '4637632': 3,\n",
       " '206112': 3,\n",
       " '259343744': 9,\n",
       " '213135420': 10,\n",
       " '1989403630': 13,\n",
       " '209440386': 12,\n",
       " '29124911': 12,\n",
       " '311460561': 6,\n",
       " '281680987': 9,\n",
       " '5332709178': 9,\n",
       " '2418384166': 19,\n",
       " '6641594661': 20,\n",
       " '5600972524': 3,\n",
       " '34282004': 21,\n",
       " '3804215976': 21,\n",
       " '410756378': 21,\n",
       " '3255499369': 15,\n",
       " '224992119': 3,\n",
       " '465130017': 9,\n",
       " '5443222529': 17,\n",
       " '190885660': 10,\n",
       " '2140638690': 1,\n",
       " '1480385540': 3,\n",
       " '5982693297': 20,\n",
       " '250924595': 15,\n",
       " '189645480': 13,\n",
       " '5690877169': 9,\n",
       " '5481826528': 21,\n",
       " '30158313': 22,\n",
       " '1016386667': 5,\n",
       " '4523934210': 1,\n",
       " '8651136': 10,\n",
       " '4731503914': 9,\n",
       " '683684066': 9,\n",
       " '243704056': 9,\n",
       " '642816441': 3,\n",
       " '180175491': 10,\n",
       " '353342370': 14,\n",
       " '897407171': 22,\n",
       " '184287253': 5,\n",
       " '1565958668': 3,\n",
       " '225351788': 10,\n",
       " '23448307': 9,\n",
       " '6523826266': 5,\n",
       " '522688754': 17,\n",
       " '3254857367': 3,\n",
       " '1413763786': 13,\n",
       " '206213364': 15,\n",
       " '1647620983': 10,\n",
       " '595075084': 10,\n",
       " '262865562': 10,\n",
       " '1413625806': 3,\n",
       " '4303289276': 11,\n",
       " '35445509': 10,\n",
       " '201183570': 16,\n",
       " '4775459479': 9,\n",
       " '284385394': 5,\n",
       " '1595558697': 15,\n",
       " '423487550': 4,\n",
       " '2241339600': 3,\n",
       " '1385137497': 2,\n",
       " '2292090531': 20,\n",
       " '304658119': 8,\n",
       " '1590242925': 3,\n",
       " '4412150793': 14,\n",
       " '3549111412': 17,\n",
       " '491182177': 3,\n",
       " '5775020584': 9,\n",
       " '9169305': 14,\n",
       " '639484132': 3,\n",
       " '1516803970': 20,\n",
       " '6314036670': 3,\n",
       " '1399009015': 3,\n",
       " '5876865778': 25,\n",
       " '356612143': 3,\n",
       " '5402506066': 3,\n",
       " '176802374': 3,\n",
       " '1545820344': 20,\n",
       " '25178863': 3,\n",
       " '1590441534': 20,\n",
       " '357214899': 3,\n",
       " '11614709': 10,\n",
       " '3556721352': 4,\n",
       " '37087529': 12,\n",
       " '2280875951': 3,\n",
       " '3258377950': 4,\n",
       " '3569114007': 2,\n",
       " '6575907551': 3,\n",
       " '5663780632': 20,\n",
       " '4885263619': 3,\n",
       " '6312484429': 19,\n",
       " '2226371710': 6,\n",
       " '20748613': 11,\n",
       " '342453462': 8,\n",
       " '4117060951': 20,\n",
       " '5983034505': 4,\n",
       " '1364035962': 17,\n",
       " '197656233': 3,\n",
       " '4635561283': 3,\n",
       " '332878781': 3,\n",
       " '1780087615': 3,\n",
       " '1321687411': 3,\n",
       " '1620994874': 3,\n",
       " '1819159587': 3,\n",
       " '1244907650': 3,\n",
       " '186453646': 11,\n",
       " '5121565584': 4,\n",
       " '1562849165': 21,\n",
       " '2116036696': 3,\n",
       " '174921635': 3,\n",
       " '1176657923': 3,\n",
       " '1394180401': 3,\n",
       " '240224942': 17,\n",
       " '532756154': 19,\n",
       " '2258287579': 11,\n",
       " '1172636595': 20,\n",
       " '187235625': 9,\n",
       " '968105924': 15,\n",
       " '281688181': 22,\n",
       " '54849423': 15,\n",
       " '194173007': 5,\n",
       " '3075383989': 14,\n",
       " '5635283125': 5,\n",
       " '9140256': 5,\n",
       " '3678834236': 9,\n",
       " '23780476': 5,\n",
       " '3111400846': 24,\n",
       " '445173203': 9,\n",
       " '222888683': 5,\n",
       " '1682587179': 5,\n",
       " '1038655044': 5,\n",
       " '4004493': 5,\n",
       " '6669112221': 5,\n",
       " '293812966': 13,\n",
       " '2080264835': 5,\n",
       " '34312408': 3,\n",
       " '15544884': 1,\n",
       " '4161379811': 15,\n",
       " '476602608': 15,\n",
       " '268994055': 9,\n",
       " '3306308329': 3,\n",
       " '245429022': 1,\n",
       " '5570819771': 18,\n",
       " '4048151096': 9,\n",
       " '3054910016': 1,\n",
       " '1104562426': 1,\n",
       " '13267212': 1,\n",
       " '6019446781': 15,\n",
       " '5671763690': 4,\n",
       " '1359739425': 6,\n",
       " '6056922568': 3,\n",
       " '1688088235': 14,\n",
       " '189344109': 1,\n",
       " '217315870': 3,\n",
       " '221747650': 20,\n",
       " '2271297765': 1,\n",
       " '665618707': 11,\n",
       " '1128642745': 15,\n",
       " '2066080425': 15,\n",
       " '46091385': 1,\n",
       " '4078694852': 3,\n",
       " '1338601945': 3,\n",
       " '6234704484': 9,\n",
       " '1691750097': 26,\n",
       " '242492259': 9,\n",
       " '423016902': 2,\n",
       " '198953576': 18,\n",
       " '5612398997': 15,\n",
       " '2017561952': 5,\n",
       " '209373583': 15,\n",
       " '639622821': 15,\n",
       " '485179292': 3,\n",
       " '1628447267': 20,\n",
       " '241652870': 11,\n",
       " '186137679': 5,\n",
       " '839399753': 19,\n",
       " '4215611586': 19,\n",
       " '6098994613': 19,\n",
       " '49469101': 12,\n",
       " '613268772': 5,\n",
       " '3440248314': 1,\n",
       " '210403810': 7,\n",
       " '354719407': 7,\n",
       " '1491273811': 2,\n",
       " '2099173097': 3,\n",
       " '187715799': 15,\n",
       " '339601': 11,\n",
       " '1819350163': 15,\n",
       " '1577310323': 8,\n",
       " '5853238148': 8,\n",
       " '1572308387': 3,\n",
       " '3086206762': 24,\n",
       " '5785724551': 24,\n",
       " '6636265838': 24,\n",
       " '39876160': 1,\n",
       " '3534188609': 6,\n",
       " '1935462489': 3,\n",
       " '476189281': 5,\n",
       " '4275301473': 15,\n",
       " '5866728559': 3,\n",
       " '508416624': 13,\n",
       " '4086087305': 3,\n",
       " '2460636811': 10,\n",
       " '2269099666': 2,\n",
       " '2463163041': 5,\n",
       " '187629218': 15,\n",
       " '13430434': 5,\n",
       " '6045727913': 5,\n",
       " '5596717742': 24,\n",
       " '4725080785': 24,\n",
       " '255907554': 5,\n",
       " '1506213605': 3,\n",
       " '3232753894': 3,\n",
       " '5357490920': 24,\n",
       " '1344734453': 15,\n",
       " '2258191611': 24,\n",
       " '4144609546': 15,\n",
       " '178999578': 15,\n",
       " '5721435943': 24,\n",
       " '40324904': 15,\n",
       " '1610345256': 9,\n",
       " '3674394957': 2,\n",
       " '23243096': 24,\n",
       " '41968988': 24,\n",
       " '5747402590': 3,\n",
       " '2294696801': 3,\n",
       " '291904355': 3,\n",
       " '144951142': 10,\n",
       " '3310958': 3,\n",
       " '3640174965': 11,\n",
       " '4264945035': 15,\n",
       " '198481320': 15,\n",
       " '1169454003': 3,\n",
       " '143847884': 5,\n",
       " '16618964': 3,\n",
       " '5728534999': 24,\n",
       " '4056288221': 5,\n",
       " '568992229': 3,\n",
       " '1992471526': 3,\n",
       " '1431656439': 15,\n",
       " '340223486': 1,\n",
       " '5790833518': 6,\n",
       " '742315155': 5,\n",
       " '194695770': 24,\n",
       " '253130753': 24,\n",
       " '413454351': 21,\n",
       " '5740686863': 20,\n",
       " '1961259560': 24,\n",
       " '4475998250': 24,\n",
       " '1211207724': 13,\n",
       " '192275013': 24,\n",
       " '1223018058': 5,\n",
       " '206622202': 24,\n",
       " '2251056211': 24,\n",
       " '552023127': 18,\n",
       " '22198385': 3,\n",
       " '4799603': 24,\n",
       " '3141249': 3,\n",
       " '176025225': 24,\n",
       " '3148773005': 24,\n",
       " '279474841': 24,\n",
       " '1743812268': 24,\n",
       " '4212508857': 3,\n",
       " '186680001': 24,\n",
       " '267951829': 3,\n",
       " '266415318': 5,\n",
       " '4583759576': 24,\n",
       " '5722923737': 20,\n",
       " '3000210668': 24,\n",
       " '1414153984': 24,\n",
       " '498031379': 8,\n",
       " '10896661': 5,\n",
       " '4233344332': 24,\n",
       " '276851036': 24,\n",
       " '32372064': 3,\n",
       " '183152016': 24,\n",
       " '22069152': 24,\n",
       " '32687542': 4,\n",
       " '34625474': 20,\n",
       " '3578871749': 3,\n",
       " '4158328774': 24,\n",
       " '1025978838': 24,\n",
       " '4626777063': 24,\n",
       " '244360169': 24,\n",
       " '3921438202': 1,\n",
       " '21902845': 24,\n",
       " '1548994050': 3,\n",
       " '3641395214': 1,\n",
       " '213018129': 15,\n",
       " '1963354644': 24,\n",
       " '550475287': 24,\n",
       " '2198366763': 24,\n",
       " '745667120': 20,\n",
       " '1695419955': 19,\n",
       " '6045137485': 3,\n",
       " '336346717': 24,\n",
       " '2091450473': 1,\n",
       " '6508661': 15,\n",
       " '329289335': 3,\n",
       " '2163345018': 3,\n",
       " '5554387584': 1,\n",
       " '1334772872': 15,\n",
       " '1595627660': 21,\n",
       " '3258906765': 1,\n",
       " '355482': 24,\n",
       " '872948891': 24,\n",
       " '1457598113': 24,\n",
       " '12447912': 5,\n",
       " '4285782721': 14,\n",
       " '5973713606': 1,\n",
       " '1583922888': 24,\n",
       " '6326256344': 1,\n",
       " '1441760480': 9,\n",
       " '1446976226': 3,\n",
       " '1763168996': 24,\n",
       " '1989401318': 24,\n",
       " '2159493350': 24,\n",
       " '425700585': 2,\n",
       " '2960009966': 1,\n",
       " '499688189': 11,\n",
       " '186165511': 9,\n",
       " '1635084040': 15,\n",
       " '204512011': 15,\n",
       " '3159685405': 15,\n",
       " '307350820': 3,\n",
       " '190918971': 21,\n",
       " '10868546': 8,\n",
       " '15796048': 15,\n",
       " '3444023646': 24,\n",
       " '1700271461': 24,\n",
       " '250400135': 9,\n",
       " '29808011': 24,\n",
       " '5667993492': 3,\n",
       " '1574088604': 15,\n",
       " '221624247': 24,\n",
       " '209174967': 24,\n",
       " '2162409408': 11,\n",
       " '365353935': 6,\n",
       " '630785491': 24,\n",
       " '9343451': 24,\n",
       " '1441714140': 2,\n",
       " '201620465': 23,\n",
       " '4116877811': 24,\n",
       " '5924696059': 24,\n",
       " '313723523': 2,\n",
       " '3476606464': 11,\n",
       " '4824472579': 24,\n",
       " '2039707661': 24,\n",
       " '1551965712': 6,\n",
       " '4631440970': 17,\n",
       " '2283259469': 15,\n",
       " '194841177': 3,\n",
       " '2271479412': 9,\n",
       " '555650': 15,\n",
       " '2275500165': 3,\n",
       " '2939144853': 1,\n",
       " '4524163738': 3,\n",
       " '245238480': 3,\n",
       " '1282856144': 1,\n",
       " '6253366489': 3,\n",
       " '1351881982': 6,\n",
       " '2296283402': 17,\n",
       " '1666413853': 2,\n",
       " '4206765358': 20,\n",
       " '5358289202': 16,\n",
       " '3947219768': 20,\n",
       " '46707517': 1,\n",
       " '1494892870': 16,\n",
       " '798072135': 3,\n",
       " '5635425623': 6,\n",
       " '558868830': 24,\n",
       " '4177249171': 3,\n",
       " '1088016286': 3,\n",
       " '3233172400': 20,\n",
       " '3040817088': 11,\n",
       " '5451343305': 3,\n",
       " '5510772685': 24,\n",
       " '3644576219': 15,\n",
       " '144582111': 20,\n",
       " '2129814509': 1,\n",
       " '4522829815': 3,\n",
       " '178315651': 24,\n",
       " '364209283': 24,\n",
       " '4064937488': 24,\n",
       " '3640879767': 3,\n",
       " '1551541792': 24,\n",
       " '2956569515': 24,\n",
       " '1212761258': 24,\n",
       " '252533585': 24,\n",
       " '5695808211': 18,\n",
       " '2218177882': 24,\n",
       " '3598887131': 24,\n",
       " '5870917239': 24,\n",
       " '200533117': 15,\n",
       " '5735846448': 1,\n",
       " '19643009': 6,\n",
       " '1990882094': 9,\n",
       " '1979727724': 6,\n",
       " '227120226': 13,\n",
       " '1970358451': 7,\n",
       " '355022486': 3,\n",
       " '2986675959': 21,\n",
       " '25273472': 24,\n",
       " '2011497647': 9,\n",
       " ...}"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\" \n",
    "MATCH (a:Community) RETURN MAX(a.name) AS m\n",
    "    \"\"\"\n",
    "\n",
    "max_result = graph.run(query).data()[0]\n",
    "max_community = int(float(max_result['m'])) + 1 if max_result['m'] else 0\n",
    "\n",
    "partitions_ids_map = {x: x + max_community for x in list(set(partitions.values()))}\n",
    "for instauser in list(partitions.keys()):\n",
    "    partitions[instauser] = partitions_ids_map[partitions[instauser]]\n",
    "\n",
    "partitions"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Okey we now have communities lets add them"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "community_nodes = {}\n",
    "for partition in list(set(partitions_ids_map.values())):\n",
    "\n",
    "    community_nodes[partition] = Node(\"Community\", name=str(partition))\n",
    "    graph.create(community_nodes[partition])\n",
    "\n",
    "    sub_community_of = Relationship(community_nodes[partition], \"SUB_COMMUNITY_OF\", root_partition)\n",
    "    graph.create(sub_community_of)\n",
    "    \n",
    "    order_of = Relationship(community_nodes[partition], \"ORDER_OF\", order_node)\n",
    "    graph.create(order_of)\n",
    "\n",
    "for instauser_id, partition in partitions.items():\n",
    "    member_of = Relationship(nodes[instauser_id], \"MEMBER_OF\", community_nodes[partition])\n",
    "    graph.create(member_of)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{0: 1,\n",
       " 1: 2,\n",
       " 2: 3,\n",
       " 3: 4,\n",
       " 4: 5,\n",
       " 5: 6,\n",
       " 6: 7,\n",
       " 7: 8,\n",
       " 8: 9,\n",
       " 9: 10,\n",
       " 10: 11,\n",
       " 11: 12,\n",
       " 12: 13,\n",
       " 13: 14,\n",
       " 14: 15,\n",
       " 15: 16,\n",
       " 16: 17,\n",
       " 17: 18,\n",
       " 18: 19,\n",
       " 19: 20,\n",
       " 20: 21,\n",
       " 21: 22,\n",
       " 22: 23,\n",
       " 23: 24,\n",
       " 24: 25,\n",
       " 25: 26,\n",
       " 26: 27,\n",
       " 27: 28,\n",
       " 28: 29,\n",
       " 29: 30,\n",
       " 30: 31,\n",
       " 31: 32,\n",
       " 32: 33}"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "partitions_ids"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH () - [a:MEMBER_OF] - () DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()\n",
    "\n",
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH () - [a:ORDER_OF] - () DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()\n",
    "\n",
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH () - [a:SUB_COMMUNITY_OF] - () DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()\n",
    "\n",
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH () - [a:PROCESSED_BY] - () DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()\n",
    "\n",
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH () - [a:CREATE] - () DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()\n",
    "\n",
    "\n",
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH (a:Community) DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()\n",
    "\n",
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH (a:Order) DELETE a\n",
    "\"\"\"\n",
    "max_result = graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "root_node = Node(\"Community\", name=str(0))\n",
    "graph.create(root_node)\n",
    "\n",
    "for instauser_id, partition in communities.items():\n",
    "    query = \"\"\"\n",
    "        MATCH (a:Instauser),(b:Community)\n",
    "        WHERE a.name = '{}' AND b.name = '{}'\n",
    "        CREATE (a)-[r:MEMBER_OF]->(b)\n",
    "        RETURN r\n",
    "    \"\"\".format(instauser_id, '0')\n",
    "    graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "            MATCH (a:Community),(b:Order)\n",
      "            WHERE a.name = '0' AND b.name = '2'\n",
      "            CREATE (a)-[r:PROCESSED_BY]->(b)\n",
      "            RETURN r\n",
      "        \n"
     ]
    }
   ],
   "source": [
    "import community\n",
    "\n",
    "partitions = community.best_partition(G)\n",
    "\n",
    "parent_community_id = '0'\n",
    "communities = partitions\n",
    "algorithm = 'louvain'\n",
    "\n",
    "database.insert_community_analysis(communities, parent_community_id, algorithm)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \\\n",
    "    \"\"\" \n",
    "    MATCH \n",
    "    (a:Instauser) - [:MEMBER_OF] - (:Community {name: '0'})\n",
    "    RETURN a.name AS name\n",
    "\"\"\"\n",
    "\n",
    "results = graph.run(query).data()\n",
    "instausers = [i['name'] for i in results]\n",
    "\n",
    "assert len(list(communities.keys())) == len(instausers)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [],
   "source": [
    "assert set(list(communities.keys())) == set(instausers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 206,
   "metadata": {},
   "outputs": [],
   "source": [
    "G = nx.read_gpickle('/home/epfl/data/output.nx')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "metadata": {},
   "outputs": [],
   "source": [
    "outdeg = G.degree()\n",
    "to_remove = [n for n in outdeg if outdeg[n] == 1]\n",
    "\n",
    "to_keep = [n for n in outdeg if outdeg[n] != 1]\n",
    "sub = G.subgraph(to_keep)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "metadata": {},
   "outputs": [],
   "source": [
    "len(sub.nodes())\n",
    "\n",
    "G = sub"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "query = \"\"\"\n",
    "    CREATE (a:Community {name: 0})\n",
    "    RETURN a\n",
    "    \"\"\"\n",
    "    \n",
    "graph.run(query)\n",
    "\n",
    "for node in G.nodes():\n",
    "    query = \"\"\"\n",
    "            MATCH (a:Instauser),(b:Community)\n",
    "            WHERE a.name = %s AND b.name = 0\n",
    "            CREATE (a)-[r:MEMBER_OF]->(b)\n",
    "            RETURN r\n",
    "        \"\"\" % (node)\n",
    "\n",
    "    graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 196,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes = {}\n",
    "edges = {}\n",
    "\n",
    "query = \"\"\"\n",
    "    CREATE (a:Community {name: 0})\n",
    "    RETURN a\n",
    "    \"\"\"\n",
    "    \n",
    "graph.run(query)\n",
    "for node in G.nodes():\n",
    "    query = \"\"\"\n",
    "    CREATE (a:Instauser {name: %s})\n",
    "    RETURN a\n",
    "    \"\"\" % str(node)\n",
    "    \n",
    "    graph.run(query)\n",
    "    \n",
    "\n",
    "    \n",
    "for source, target in G.edges():\n",
    "    query = \"\"\"\n",
    "            MATCH (a:Instauser),(b:Instauser)\n",
    "            WHERE a.name = %s AND b.name = %s\n",
    "            CREATE (a)-[r:LIKED]->(b)\n",
    "            RETURN r\n",
    "        \"\"\" % (source, target)\n",
    "\n",
    "    graph.run(query)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{36950375: (:Instauser {name: '36950375'}),\n",
       " 227821023: (:Instauser {name: '227821023'}),\n",
       " 321272: (:Instauser {name: '321272'}),\n",
       " 7074412: (:Instauser {name: '7074412'}),\n",
       " 1779894666: (:Instauser {name: '1779894666'}),\n",
       " 524980639: (:Instauser {name: '524980639'}),\n",
       " 772581894: (:Instauser {name: '772581894'}),\n",
       " 5443599152: (:Instauser {name: '5443599152'}),\n",
       " 1572241409: (:Instauser {name: '1572241409'}),\n",
       " 323835957: (:Instauser {name: '323835957'}),\n",
       " 357095537: (:Instauser {name: '357095537'}),\n",
       " 5996359794: (:Instauser {name: '5996359794'}),\n",
       " 2275500165: (:Instauser {name: '2275500165'}),\n",
       " 333078712: (:Instauser {name: '333078712'}),\n",
       " 5912606913: (:Instauser {name: '5912606913'}),\n",
       " 305887429: (:Instauser {name: '305887429'}),\n",
       " 209293513: (:Instauser {name: '209293513'}),\n",
       " 1317699805: (:Instauser {name: '1317699805'}),\n",
       " 1813956840: (:Instauser {name: '1813956840'}),\n",
       " 3678617854: (:Instauser {name: '3678617854'}),\n",
       " 1309886720: (:Instauser {name: '1309886720'}),\n",
       " 457552142: (:Instauser {name: '457552142'}),\n",
       " 2024919313: (:Instauser {name: '2024919313'}),\n",
       " 3996821788: (:Instauser {name: '3996821788'}),\n",
       " 1298422046: (:Instauser {name: '1298422046'}),\n",
       " 1443031356: (:Instauser {name: '1443031356'}),\n",
       " 570253636: (:Instauser {name: '570253636'}),\n",
       " 4827717977: (:Instauser {name: '4827717977'}),\n",
       " 5474885990: (:Instauser {name: '5474885990'}),\n",
       " 378827113: (:Instauser {name: '378827113'}),\n",
       " 6193359217: (:Instauser {name: '6193359217'}),\n",
       " 5992417673: (:Instauser {name: '5992417673'}),\n",
       " 1629378964: (:Instauser {name: '1629378964'}),\n",
       " 4734722452: (:Instauser {name: '4734722452'}),\n",
       " 25489829: (:Instauser {name: '25489829'}),\n",
       " 41656754: (:Instauser {name: '41656754'}),\n",
       " 2004939200: (:Instauser {name: '2004939200'}),\n",
       " 1467533764: (:Instauser {name: '1467533764'}),\n",
       " 248793549: (:Instauser {name: '248793549'}),\n",
       " 3612895734: (:Instauser {name: '3612895734'}),\n",
       " 194660866: (:Instauser {name: '194660866'}),\n",
       " 618695195: (:Instauser {name: '618695195'}),\n",
       " 2287409729: (:Instauser {name: '2287409729'}),\n",
       " 50690646: (:Instauser {name: '50690646'}),\n",
       " 565590641: (:Instauser {name: '565590641'}),\n",
       " 3640879767: (:Instauser {name: '3640879767'}),\n",
       " 3465169573: (:Instauser {name: '3465169573'}),\n",
       " 1647520425: (:Instauser {name: '1647520425'}),\n",
       " 2266645206: (:Instauser {name: '2266645206'}),\n",
       " 33878767: (:Instauser {name: '33878767'}),\n",
       " 1554369274: (:Instauser {name: '1554369274'}),\n",
       " 48382762: (:Instauser {name: '48382762'}),\n",
       " 217144106: (:Instauser {name: '217144106'}),\n",
       " 2273551151: (:Instauser {name: '2273551151'}),\n",
       " 401513287: (:Instauser {name: '401513287'}),\n",
       " 4479474514: (:Instauser {name: '4479474514'}),\n",
       " 2888550: (:Instauser {name: '2888550'}),\n",
       " 3625227121: (:Instauser {name: '3625227121'}),\n",
       " 4231254900: (:Instauser {name: '4231254900'}),\n",
       " 2651001: (:Instauser {name: '2651001'}),\n",
       " 1452870538: (:Instauser {name: '1452870538'}),\n",
       " 5433007006: (:Instauser {name: '5433007006'}),\n",
       " 15612836: (:Instauser {name: '15612836'}),\n",
       " 1407909: (:Instauser {name: '1407909'}),\n",
       " 2427780010: (:Instauser {name: '2427780010'}),\n",
       " 1519725490: (:Instauser {name: '1519725490'}),\n",
       " 3550166000: (:Instauser {name: '3550166000'}),\n",
       " 1475400696: (:Instauser {name: '1475400696'}),\n",
       " 4216290303: (:Instauser {name: '4216290303'}),\n",
       " 1165208595: (:Instauser {name: '1165208595'}),\n",
       " 362869799: (:Instauser {name: '362869799'}),\n",
       " 6246054987: (:Instauser {name: '6246054987'}),\n",
       " 3468512340: (:Instauser {name: '3468512340'}),\n",
       " 291095641: (:Instauser {name: '291095641'}),\n",
       " 5866728559: (:Instauser {name: '5866728559'}),\n",
       " 20110451: (:Instauser {name: '20110451'}),\n",
       " 4058471558: (:Instauser {name: '4058471558'}),\n",
       " 2096366738: (:Instauser {name: '2096366738'}),\n",
       " 3505763512: (:Instauser {name: '3505763512'}),\n",
       " 49429730: (:Instauser {name: '49429730'}),\n",
       " 5981342956: (:Instauser {name: '5981342956'}),\n",
       " 314146034: (:Instauser {name: '314146034'}),\n",
       " 5443116299: (:Instauser {name: '5443116299'}),\n",
       " 275367216: (:Instauser {name: '275367216'}),\n",
       " 3435001136: (:Instauser {name: '3435001136'}),\n",
       " 2150317374: (:Instauser {name: '2150317374'}),\n",
       " 3270229338: (:Instauser {name: '3270229338'}),\n",
       " 32372064: (:Instauser {name: '32372064'}),\n",
       " 347725192: (:Instauser {name: '347725192'}),\n",
       " 2000332172: (:Instauser {name: '2000332172'}),\n",
       " 21716380: (:Instauser {name: '21716380'}),\n",
       " 1722600866: (:Instauser {name: '1722600866'}),\n",
       " 179439030: (:Instauser {name: '179439030'}),\n",
       " 2221913527: (:Instauser {name: '2221913527'}),\n",
       " 5451343305: (:Instauser {name: '5451343305'}),\n",
       " 3645189582: (:Instauser {name: '3645189582'}),\n",
       " 3292110310: (:Instauser {name: '3292110310'}),\n",
       " 3130858998: (:Instauser {name: '3130858998'}),\n",
       " 1548994050: (:Instauser {name: '1548994050'}),\n",
       " 492936716: (:Instauser {name: '492936716'}),\n",
       " 6311874063: (:Instauser {name: '6311874063'}),\n",
       " 5924703794: (:Instauser {name: '5924703794'}),\n",
       " 3171360335: (:Instauser {name: '3171360335'}),\n",
       " 50259536: (:Instauser {name: '50259536'}),\n",
       " 1432925786: (:Instauser {name: '1432925786'}),\n",
       " 1379915374: (:Instauser {name: '1379915374'}),\n",
       " 1004639879: (:Instauser {name: '1004639879'}),\n",
       " 4409689736: (:Instauser {name: '4409689736'}),\n",
       " 5818939025: (:Instauser {name: '5818939025'}),\n",
       " 6018784934: (:Instauser {name: '6018784934'}),\n",
       " 5982404298: (:Instauser {name: '5982404298'}),\n",
       " 267951829: (:Instauser {name: '267951829'}),\n",
       " 3289913076: (:Instauser {name: '3289913076'}),\n",
       " 5377126190: (:Instauser {name: '5377126190'}),\n",
       " 1558406959: (:Instauser {name: '1558406959'}),\n",
       " 5747402590: (:Instauser {name: '5747402590'}),\n",
       " 581640064: (:Instauser {name: '581640064'}),\n",
       " 364429185: (:Instauser {name: '364429185'}),\n",
       " 3432359811: (:Instauser {name: '3432359811'}),\n",
       " 240582534: (:Instauser {name: '240582534'}),\n",
       " 6295433: (:Instauser {name: '6295433'}),\n",
       " 1326989214: (:Instauser {name: '1326989214'}),\n",
       " 187303840: (:Instauser {name: '187303840'}),\n",
       " 229930916: (:Instauser {name: '229930916'}),\n",
       " 3578871749: (:Instauser {name: '3578871749'}),\n",
       " 2974492622: (:Instauser {name: '2974492622'}),\n",
       " 2911229918: (:Instauser {name: '2911229918'}),\n",
       " 4418674667: (:Instauser {name: '4418674667'}),\n",
       " 1348106225: (:Instauser {name: '1348106225'}),\n",
       " 1371924472: (:Instauser {name: '1371924472'}),\n",
       " 3582327819: (:Instauser {name: '3582327819'}),\n",
       " 206411276: (:Instauser {name: '206411276'}),\n",
       " 31564302: (:Instauser {name: '31564302'}),\n",
       " 232078352: (:Instauser {name: '232078352'}),\n",
       " 3086466577: (:Instauser {name: '3086466577'}),\n",
       " 2095206417: (:Instauser {name: '2095206417'}),\n",
       " 1277021720: (:Instauser {name: '1277021720'}),\n",
       " 4622458906: (:Instauser {name: '4622458906'}),\n",
       " 6207049243: (:Instauser {name: '6207049243'}),\n",
       " 5894905886: (:Instauser {name: '5894905886'}),\n",
       " 48834083: (:Instauser {name: '48834083'}),\n",
       " 2074352678: (:Instauser {name: '2074352678'}),\n",
       " 24233512: (:Instauser {name: '24233512'}),\n",
       " 41230892: (:Instauser {name: '41230892'}),\n",
       " 2009449004: (:Instauser {name: '2009449004'}),\n",
       " 3231818803: (:Instauser {name: '3231818803'}),\n",
       " 5774472248: (:Instauser {name: '5774472248'}),\n",
       " 509896762: (:Instauser {name: '509896762'}),\n",
       " 1022158398: (:Instauser {name: '1022158398'}),\n",
       " 417925184: (:Instauser {name: '417925184'}),\n",
       " 195664963: (:Instauser {name: '195664963'}),\n",
       " 2963609155: (:Instauser {name: '2963609155'}),\n",
       " 184118855: (:Instauser {name: '184118855'}),\n",
       " 227031106: (:Instauser {name: '227031106'}),\n",
       " 2160086594: (:Instauser {name: '2160086594'}),\n",
       " 24745034: (:Instauser {name: '24745034'}),\n",
       " 4196608075: (:Instauser {name: '4196608075'}),\n",
       " 242294355: (:Instauser {name: '242294355'}),\n",
       " 26028630: (:Instauser {name: '26028630'}),\n",
       " 1989568090: (:Instauser {name: '1989568090'}),\n",
       " 1118789217: (:Instauser {name: '1118789217'}),\n",
       " 3557034593: (:Instauser {name: '3557034593'}),\n",
       " 183282792: (:Instauser {name: '183282792'}),\n",
       " 3670518889: (:Instauser {name: '3670518889'}),\n",
       " 6677190767: (:Instauser {name: '6677190767'}),\n",
       " 4513980532: (:Instauser {name: '4513980532'}),\n",
       " 2980340853: (:Instauser {name: '2980340853'}),\n",
       " 6241946234: (:Instauser {name: '6241946234'}),\n",
       " 241197690: (:Instauser {name: '241197690'}),\n",
       " 3623159932: (:Instauser {name: '3623159932'}),\n",
       " 1578128001: (:Instauser {name: '1578128001'}),\n",
       " 412113542: (:Instauser {name: '412113542'}),\n",
       " 5524019851: (:Instauser {name: '5524019851'}),\n",
       " 5686902925: (:Instauser {name: '5686902925'}),\n",
       " 2141130379: (:Instauser {name: '2141130379'}),\n",
       " 410511504: (:Instauser {name: '410511504'}),\n",
       " 4178779279: (:Instauser {name: '4178779279'}),\n",
       " 38393493: (:Instauser {name: '38393493'}),\n",
       " 3181585048: (:Instauser {name: '3181585048'}),\n",
       " 6113375385: (:Instauser {name: '6113375385'}),\n",
       " 4560601753: (:Instauser {name: '4560601753'}),\n",
       " 3056102048: (:Instauser {name: '3056102048'}),\n",
       " 1803360933: (:Instauser {name: '1803360933'}),\n",
       " 1615465142: (:Instauser {name: '1615465142'}),\n",
       " 50815158: (:Instauser {name: '50815158'}),\n",
       " 1619001532: (:Instauser {name: '1619001532'}),\n",
       " 46184128: (:Instauser {name: '46184128'}),\n",
       " 1859268: (:Instauser {name: '1859268'}),\n",
       " 581918911: (:Instauser {name: '581918911'}),\n",
       " 3108887230: (:Instauser {name: '3108887230'}),\n",
       " 6084518600: (:Instauser {name: '6084518600'}),\n",
       " 19651788: (:Instauser {name: '19651788'}),\n",
       " 5643581142: (:Instauser {name: '5643581142'}),\n",
       " 3110102232: (:Instauser {name: '3110102232'}),\n",
       " 3591254745: (:Instauser {name: '3591254745'}),\n",
       " 3086222552: (:Instauser {name: '3086222552'}),\n",
       " 216488156: (:Instauser {name: '216488156'}),\n",
       " 2102309598: (:Instauser {name: '2102309598'}),\n",
       " 3582701278: (:Instauser {name: '3582701278'}),\n",
       " 1506213605: (:Instauser {name: '1506213605'}),\n",
       " 235880182: (:Instauser {name: '235880182'}),\n",
       " 248205048: (:Instauser {name: '248205048'}),\n",
       " 5727627524: (:Instauser {name: '5727627524'}),\n",
       " 644650764: (:Instauser {name: '644650764'}),\n",
       " 30165261: (:Instauser {name: '30165261'}),\n",
       " 3062770957: (:Instauser {name: '3062770957'}),\n",
       " 1462475023: (:Instauser {name: '1462475023'}),\n",
       " 52649758: (:Instauser {name: '52649758'}),\n",
       " 4487870239: (:Instauser {name: '4487870239'}),\n",
       " 1364455198: (:Instauser {name: '1364455198'}),\n",
       " 179069222: (:Instauser {name: '179069222'}),\n",
       " 5804184363: (:Instauser {name: '5804184363'}),\n",
       " 4367665455: (:Instauser {name: '4367665455'}),\n",
       " 272297264: (:Instauser {name: '272297264'}),\n",
       " 4845087537: (:Instauser {name: '4845087537'}),\n",
       " 1217474868: (:Instauser {name: '1217474868'}),\n",
       " 5652755261: (:Instauser {name: '5652755261'}),\n",
       " 3700876098: (:Instauser {name: '3700876098'}),\n",
       " 6012605762: (:Instauser {name: '6012605762'}),\n",
       " 213492043: (:Instauser {name: '213492043'}),\n",
       " 11977553: (:Instauser {name: '11977553'}),\n",
       " 2729039700: (:Instauser {name: '2729039700'}),\n",
       " 6079837031: (:Instauser {name: '6079837031'}),\n",
       " 2162849638: (:Instauser {name: '2162849638'}),\n",
       " 1932023657: (:Instauser {name: '1932023657'}),\n",
       " 6313763690: (:Instauser {name: '6313763690'}),\n",
       " 184039281: (:Instauser {name: '184039281'}),\n",
       " 4209302904: (:Instauser {name: '4209302904'}),\n",
       " 1621010809: (:Instauser {name: '1621010809'}),\n",
       " 964284795: (:Instauser {name: '964284795'}),\n",
       " 2287752060: (:Instauser {name: '2287752060'}),\n",
       " 5612854653: (:Instauser {name: '5612854653'}),\n",
       " 3529896317: (:Instauser {name: '3529896317'}),\n",
       " 3582565249: (:Instauser {name: '3582565249'}),\n",
       " 2021820804: (:Instauser {name: '2021820804'}),\n",
       " 7977862: (:Instauser {name: '7977862'}),\n",
       " 200606599: (:Instauser {name: '200606599'}),\n",
       " 2239976328: (:Instauser {name: '2239976328'}),\n",
       " 3946216326: (:Instauser {name: '3946216326'}),\n",
       " 285525397: (:Instauser {name: '285525397'}),\n",
       " 3868266910: (:Instauser {name: '3868266910'}),\n",
       " 2774432: (:Instauser {name: '2774432'}),\n",
       " 265553313: (:Instauser {name: '265553313'}),\n",
       " 369808808: (:Instauser {name: '369808808'}),\n",
       " 1966109610: (:Instauser {name: '1966109610'}),\n",
       " 218549676: (:Instauser {name: '218549676'}),\n",
       " 911264179: (:Instauser {name: '911264179'}),\n",
       " 4293860788: (:Instauser {name: '4293860788'}),\n",
       " 1478809017: (:Instauser {name: '1478809017'}),\n",
       " 1730584514: (:Instauser {name: '1730584514'}),\n",
       " 8126408: (:Instauser {name: '8126408'}),\n",
       " 55757264: (:Instauser {name: '55757264'}),\n",
       " 143910352: (:Instauser {name: '143910352'}),\n",
       " 235087316: (:Instauser {name: '235087316'}),\n",
       " 21025238: (:Instauser {name: '21025238'}),\n",
       " 881107413: (:Instauser {name: '881107413'}),\n",
       " 2257547737: (:Instauser {name: '2257547737'}),\n",
       " 498965468: (:Instauser {name: '498965468'}),\n",
       " 3258831841: (:Instauser {name: '3258831841'}),\n",
       " 3082257896: (:Instauser {name: '3082257896'}),\n",
       " 2284201449: (:Instauser {name: '2284201449'}),\n",
       " 2111218668: (:Instauser {name: '2111218668'}),\n",
       " 4018119664: (:Instauser {name: '4018119664'}),\n",
       " 190659063: (:Instauser {name: '190659063'}),\n",
       " 188875770: (:Instauser {name: '188875770'}),\n",
       " 1692891138: (:Instauser {name: '1692891138'}),\n",
       " 21560877: (:Instauser {name: '21560877'}),\n",
       " 261873203: (:Instauser {name: '261873203'}),\n",
       " 3541801012: (:Instauser {name: '3541801012'}),\n",
       " 16181825: (:Instauser {name: '16181825'}),\n",
       " 2015672905: (:Instauser {name: '2015672905'}),\n",
       " 2082713181: (:Instauser {name: '2082713181'}),\n",
       " 10876526: (:Instauser {name: '10876526'}),\n",
       " 4080712814: (:Instauser {name: '4080712814'}),\n",
       " 227917939: (:Instauser {name: '227917939'}),\n",
       " 1599916680: (:Instauser {name: '1599916680'}),\n",
       " 8713355: (:Instauser {name: '8713355'}),\n",
       " 196809366: (:Instauser {name: '196809366'}),\n",
       " 145362583: (:Instauser {name: '145362583'}),\n",
       " 184195742: (:Instauser {name: '184195742'}),\n",
       " 3676635815: (:Instauser {name: '3676635815'}),\n",
       " 328165572: (:Instauser {name: '328165572'}),\n",
       " 4843330757: (:Instauser {name: '4843330757'}),\n",
       " 5718432970: (:Instauser {name: '5718432970'}),\n",
       " 3083022031: (:Instauser {name: '3083022031'}),\n",
       " 1377122008: (:Instauser {name: '1377122008'}),\n",
       " 5340818140: (:Instauser {name: '5340818140'}),\n",
       " 5328222949: (:Instauser {name: '5328222949'}),\n",
       " 5665820907: (:Instauser {name: '5665820907'}),\n",
       " 2179036407: (:Instauser {name: '2179036407'}),\n",
       " 5638042875: (:Instauser {name: '5638042875'}),\n",
       " 213765378: (:Instauser {name: '213765378'}),\n",
       " 177328419: (:Instauser {name: '177328419'}),\n",
       " 20344639: (:Instauser {name: '20344639'}),\n",
       " 6281392968: (:Instauser {name: '6281392968'}),\n",
       " 8748369: (:Instauser {name: '8748369'}),\n",
       " 1459842046: (:Instauser {name: '1459842046'}),\n",
       " 224414050: (:Instauser {name: '224414050'}),\n",
       " 1466519394: (:Instauser {name: '1466519394'}),\n",
       " 220310910: (:Instauser {name: '220310910'}),\n",
       " 3235809665: (:Instauser {name: '3235809665'}),\n",
       " 2039080845: (:Instauser {name: '2039080845'}),\n",
       " 470999444: (:Instauser {name: '470999444'}),\n",
       " 354895257: (:Instauser {name: '354895257'}),\n",
       " 302326696: (:Instauser {name: '302326696'}),\n",
       " 2183156662: (:Instauser {name: '2183156662'}),\n",
       " 297585598: (:Instauser {name: '297585598'}),\n",
       " 200298434: (:Instauser {name: '200298434'}),\n",
       " 4005131719: (:Instauser {name: '4005131719'}),\n",
       " 4270560: (:Instauser {name: '4270560'}),\n",
       " 3987599855: (:Instauser {name: '3987599855'}),\n",
       " 4942719996: (:Instauser {name: '4942719996'}),\n",
       " 1781151756: (:Instauser {name: '1781151756'}),\n",
       " 4420996622: (:Instauser {name: '4420996622'}),\n",
       " 261210128: (:Instauser {name: '261210128'}),\n",
       " 5434660883: (:Instauser {name: '5434660883'}),\n",
       " 49266712: (:Instauser {name: '49266712'}),\n",
       " 349167135: (:Instauser {name: '349167135'}),\n",
       " 1397515812: (:Instauser {name: '1397515812'}),\n",
       " 6471603764: (:Instauser {name: '6471603764'}),\n",
       " 5938507845: (:Instauser {name: '5938507845'}),\n",
       " 2974620240: (:Instauser {name: '2974620240'}),\n",
       " 5721040471: (:Instauser {name: '5721040471'}),\n",
       " 3537740405: (:Instauser {name: '3537740405'}),\n",
       " 2308179592: (:Instauser {name: '2308179592'}),\n",
       " 1516233360: (:Instauser {name: '1516233360'}),\n",
       " 34165907: (:Instauser {name: '34165907'}),\n",
       " 4145795741: (:Instauser {name: '4145795741'}),\n",
       " 505627807: (:Instauser {name: '505627807'}),\n",
       " 183755937: (:Instauser {name: '183755937'}),\n",
       " 2898632363: (:Instauser {name: '2898632363'}),\n",
       " 4871701187: (:Instauser {name: '4871701187'}),\n",
       " 6076957388: (:Instauser {name: '6076957388'}),\n",
       " 235508429: (:Instauser {name: '235508429'}),\n",
       " 2234513108: (:Instauser {name: '2234513108'}),\n",
       " 15162367: (:Instauser {name: '15162367'}),\n",
       " 428051682: (:Instauser {name: '428051682'}),\n",
       " 2460466405: (:Instauser {name: '2460466405'}),\n",
       " 6413033: (:Instauser {name: '6413033'}),\n",
       " 1405370607: (:Instauser {name: '1405370607'}),\n",
       " 1668575984: (:Instauser {name: '1668575984'}),\n",
       " 3593366767: (:Instauser {name: '3593366767'}),\n",
       " 240719612: (:Instauser {name: '240719612'}),\n",
       " 3510385410: (:Instauser {name: '3510385410'}),\n",
       " 816902: (:Instauser {name: '816902'}),\n",
       " 6516914445: (:Instauser {name: '6516914445'}),\n",
       " 5472859922: (:Instauser {name: '5472859922'}),\n",
       " 4225017108: (:Instauser {name: '4225017108'}),\n",
       " 4522669842: (:Instauser {name: '4522669842'}),\n",
       " 1936430367: (:Instauser {name: '1936430367'}),\n",
       " 3544131874: (:Instauser {name: '3544131874'}),\n",
       " 31207209: (:Instauser {name: '31207209'}),\n",
       " 5391746349: (:Instauser {name: '5391746349'}),\n",
       " 739116338: (:Instauser {name: '739116338'}),\n",
       " 453796149: (:Instauser {name: '453796149'}),\n",
       " 1316150: (:Instauser {name: '1316150'}),\n",
       " 1437369159: (:Instauser {name: '1437369159'}),\n",
       " 3056997004: (:Instauser {name: '3056997004'}),\n",
       " 33554269: (:Instauser {name: '33554269'}),\n",
       " 510250353: (:Instauser {name: '510250353'}),\n",
       " 585509238: (:Instauser {name: '585509238'}),\n",
       " 4852349301: (:Instauser {name: '4852349301'}),\n",
       " 1324407164: (:Instauser {name: '1324407164'}),\n",
       " 4451714: (:Instauser {name: '4451714'}),\n",
       " 43672476: (:Instauser {name: '43672476'}),\n",
       " 990367651: (:Instauser {name: '990367651'}),\n",
       " 4968964003: (:Instauser {name: '4968964003'}),\n",
       " 1985720740: (:Instauser {name: '1985720740'}),\n",
       " 5850021803: (:Instauser {name: '5850021803'}),\n",
       " 1539776429: (:Instauser {name: '1539776429'}),\n",
       " 208564145: (:Instauser {name: '208564145'}),\n",
       " 2106762677: (:Instauser {name: '2106762677'}),\n",
       " 2250678: (:Instauser {name: '2250678'}),\n",
       " 3618886071: (:Instauser {name: '3618886071'}),\n",
       " 223532988: (:Instauser {name: '223532988'}),\n",
       " 2323320765: (:Instauser {name: '2323320765'}),\n",
       " 6207807432: (:Instauser {name: '6207807432'}),\n",
       " 11796937: (:Instauser {name: '11796937'}),\n",
       " 435870669: (:Instauser {name: '435870669'}),\n",
       " 1130656208: (:Instauser {name: '1130656208'}),\n",
       " 5560204796: (:Instauser {name: '5560204796'}),\n",
       " 23089632: (:Instauser {name: '23089632'}),\n",
       " 55966177: (:Instauser {name: '55966177'}),\n",
       " 144727025: (:Instauser {name: '144727025'}),\n",
       " 144190963: (:Instauser {name: '144190963'}),\n",
       " 284052482: (:Instauser {name: '284052482'}),\n",
       " 6369554451: (:Instauser {name: '6369554451'}),\n",
       " 2256344112: (:Instauser {name: '2256344112'}),\n",
       " 4398693945: (:Instauser {name: '4398693945'}),\n",
       " 2318636618: (:Instauser {name: '2318636618'}),\n",
       " 1343619147: (:Instauser {name: '1343619147'}),\n",
       " 5414973539: (:Instauser {name: '5414973539'}),\n",
       " 559788683: (:Instauser {name: '559788683'}),\n",
       " 1780561118: (:Instauser {name: '1780561118'}),\n",
       " 4847492321: (:Instauser {name: '4847492321'}),\n",
       " 1433895152: (:Instauser {name: '1433895152'}),\n",
       " 20451569: (:Instauser {name: '20451569'}),\n",
       " 1507089143: (:Instauser {name: '1507089143'}),\n",
       " 32085789: (:Instauser {name: '32085789'}),\n",
       " 43221808: (:Instauser {name: '43221808'}),\n",
       " 3643424598: (:Instauser {name: '3643424598'}),\n",
       " 5384863063: (:Instauser {name: '5384863063'}),\n",
       " 1005973352: (:Instauser {name: '1005973352'}),\n",
       " 17146323: (:Instauser {name: '17146323'}),\n",
       " 1126834133: (:Instauser {name: '1126834133'}),\n",
       " 1515661801: (:Instauser {name: '1515661801'}),\n",
       " 27504142: (:Instauser {name: '27504142'}),\n",
       " 543139854: (:Instauser {name: '543139854'}),\n",
       " 1527993368: (:Instauser {name: '1527993368'}),\n",
       " 1909968925: (:Instauser {name: '1909968925'}),\n",
       " 1618624040: (:Instauser {name: '1618624040'}),\n",
       " 247629866: (:Instauser {name: '247629866'}),\n",
       " 278588457: (:Instauser {name: '278588457'}),\n",
       " 190221876: (:Instauser {name: '190221876'}),\n",
       " 6206514: (:Instauser {name: '6206514'}),\n",
       " 4021536827: (:Instauser {name: '4021536827'}),\n",
       " 4248932934: (:Instauser {name: '4248932934'}),\n",
       " 2071909960: (:Instauser {name: '2071909960'}),\n",
       " 247389269: (:Instauser {name: '247389269'}),\n",
       " 503117923: (:Instauser {name: '503117923'}),\n",
       " 3575601771: (:Instauser {name: '3575601771'}),\n",
       " 8334963: (:Instauser {name: '8334963'}),\n",
       " 3087469176: (:Instauser {name: '3087469176'}),\n",
       " 39002233: (:Instauser {name: '39002233'}),\n",
       " 5770181243: (:Instauser {name: '5770181243'}),\n",
       " 5437706365: (:Instauser {name: '5437706365'}),\n",
       " 581310611: (:Instauser {name: '581310611'}),\n",
       " 48713879: (:Instauser {name: '48713879'}),\n",
       " 758955: (:Instauser {name: '758955'}),\n",
       " 1902515910: (:Instauser {name: '1902515910'}),\n",
       " 3666635: (:Instauser {name: '3666635'}),\n",
       " 3414653645: (:Instauser {name: '3414653645'}),\n",
       " 3462640851: (:Instauser {name: '3462640851'}),\n",
       " 6238296291: (:Instauser {name: '6238296291'}),\n",
       " 539100391: (:Instauser {name: '539100391'}),\n",
       " 1829452009: (:Instauser {name: '1829452009'}),\n",
       " 2947223795: (:Instauser {name: '2947223795'}),\n",
       " 1153684724: (:Instauser {name: '1153684724'}),\n",
       " 29852926: (:Instauser {name: '29852926'}),\n",
       " 26301704: (:Instauser {name: '26301704'}),\n",
       " 28579595: (:Instauser {name: '28579595'}),\n",
       " 5273694483: (:Instauser {name: '5273694483'}),\n",
       " 574126361: (:Instauser {name: '574126361'}),\n",
       " 39972636: (:Instauser {name: '39972636'}),\n",
       " 51974440: (:Instauser {name: '51974440'}),\n",
       " 5026132779: (:Instauser {name: '5026132779'}),\n",
       " 5721301829: (:Instauser {name: '5721301829'}),\n",
       " 2316007247: (:Instauser {name: '2316007247'}),\n",
       " 3571755857: (:Instauser {name: '3571755857'}),\n",
       " 2294696801: (:Instauser {name: '2294696801'}),\n",
       " 243571559: (:Instauser {name: '243571559'}),\n",
       " 276265844: (:Instauser {name: '276265844'}),\n",
       " 44938629: (:Instauser {name: '44938629'}),\n",
       " 1418631070: (:Instauser {name: '1418631070'}),\n",
       " 15062947: (:Instauser {name: '15062947'}),\n",
       " 207532976: (:Instauser {name: '207532976'}),\n",
       " 278704054: (:Instauser {name: '278704054'}),\n",
       " 628791744: (:Instauser {name: '628791744'}),\n",
       " 42295747: (:Instauser {name: '42295747'}),\n",
       " 28263369: (:Instauser {name: '28263369'}),\n",
       " 197679593: (:Instauser {name: '197679593'}),\n",
       " 1310506495: (:Instauser {name: '1310506495'}),\n",
       " 2931905017: (:Instauser {name: '2931905017'}),\n",
       " 6307154453: (:Instauser {name: '6307154453'}),\n",
       " 6313043123: (:Instauser {name: '6313043123'}),\n",
       " 5789087801: (:Instauser {name: '5789087801'}),\n",
       " 189798845: (:Instauser {name: '189798845'}),\n",
       " 2671348581: (:Instauser {name: '2671348581'}),\n",
       " 4176085617: (:Instauser {name: '4176085617'}),\n",
       " 2163345018: (:Instauser {name: '2163345018'}),\n",
       " 219261075: (:Instauser {name: '219261075'}),\n",
       " 3994566176: (:Instauser {name: '3994566176'}),\n",
       " 5642111904: (:Instauser {name: '5642111904'}),\n",
       " 1700715302: (:Instauser {name: '1700715302'}),\n",
       " 1767685557: (:Instauser {name: '1767685557'}),\n",
       " 6420773315: (:Instauser {name: '6420773315'}),\n",
       " 233164138: (:Instauser {name: '233164138'}),\n",
       " 444480248: (:Instauser {name: '444480248'}),\n",
       " 13105187: (:Instauser {name: '13105187'}),\n",
       " 1548276390: (:Instauser {name: '1548276390'}),\n",
       " 2269099666: (:Instauser {name: '2269099666'}),\n",
       " 4147090771: (:Instauser {name: '4147090771'}),\n",
       " 1700247441: (:Instauser {name: '1700247441'}),\n",
       " 6049088403: (:Instauser {name: '6049088403'}),\n",
       " 1088445906: (:Instauser {name: '1088445906'}),\n",
       " 41622997: (:Instauser {name: '41622997'}),\n",
       " 6383046643: (:Instauser {name: '6383046643'}),\n",
       " 4345837614: (:Instauser {name: '4345837614'}),\n",
       " 509130908: (:Instauser {name: '509130908'}),\n",
       " 193362288: (:Instauser {name: '193362288'}),\n",
       " 261999056: (:Instauser {name: '261999056'}),\n",
       " 1675762182: (:Instauser {name: '1675762182'}),\n",
       " 652665443: (:Instauser {name: '652665443'}),\n",
       " 179045134: (:Instauser {name: '179045134'}),\n",
       " 291904355: (:Instauser {name: '291904355'}),\n",
       " 337836964: (:Instauser {name: '337836964'}),\n",
       " 6250396600: (:Instauser {name: '6250396600'}),\n",
       " 223634457: (:Instauser {name: '223634457'}),\n",
       " 5347779751: (:Instauser {name: '5347779751'}),\n",
       " 299097650: (:Instauser {name: '299097650'}),\n",
       " 5723332229: (:Instauser {name: '5723332229'}),\n",
       " 4086087305: (:Instauser {name: '4086087305'}),\n",
       " 536577708: (:Instauser {name: '536577708'}),\n",
       " 1480275833: (:Instauser {name: '1480275833'}),\n",
       " 1107507240: (:Instauser {name: '1107507240'}),\n",
       " 180564533: (:Instauser {name: '180564533'}),\n",
       " 25155666: (:Instauser {name: '25155666'}),\n",
       " 6008013928: (:Instauser {name: '6008013928'}),\n",
       " 5554387584: (:Instauser {name: '5554387584'}),\n",
       " 1108887694: (:Instauser {name: '1108887694'}),\n",
       " 3928990352: (:Instauser {name: '3928990352'}),\n",
       " 3629185219: (:Instauser {name: '3629185219'}),\n",
       " 6483907329: (:Instauser {name: '6483907329'}),\n",
       " 4526265192: (:Instauser {name: '4526265192'}),\n",
       " 3969219459: (:Instauser {name: '3969219459'}),\n",
       " 1557936: (:Instauser {name: '1557936'}),\n",
       " 3688286183: (:Instauser {name: '3688286183'}),\n",
       " 228629230: (:Instauser {name: '228629230'}),\n",
       " 502742067: (:Instauser {name: '502742067'}),\n",
       " 35391640: (:Instauser {name: '35391640'}),\n",
       " 4200976693: (:Instauser {name: '4200976693'}),\n",
       " 304863235: (:Instauser {name: '304863235'}),\n",
       " 1504114182: (:Instauser {name: '1504114182'}),\n",
       " 27680776: (:Instauser {name: '27680776'}),\n",
       " 225486855: (:Instauser {name: '225486855'}),\n",
       " 625254405: (:Instauser {name: '625254405'}),\n",
       " 1795314699: (:Instauser {name: '1795314699'}),\n",
       " 244466180: (:Instauser {name: '244466180'}),\n",
       " 1646944783: (:Instauser {name: '1646944783'}),\n",
       " 2160774160: (:Instauser {name: '2160774160'}),\n",
       " 208947729: (:Instauser {name: '208947729'}),\n",
       " 5774613521: (:Instauser {name: '5774613521'}),\n",
       " 192629272: (:Instauser {name: '192629272'}),\n",
       " 17998873: (:Instauser {name: '17998873'}),\n",
       " 312986651: (:Instauser {name: '312986651'}),\n",
       " 183327260: (:Instauser {name: '183327260'}),\n",
       " 214939168: (:Instauser {name: '214939168'}),\n",
       " 225394209: (:Instauser {name: '225394209'}),\n",
       " 6349204510: (:Instauser {name: '6349204510'}),\n",
       " 289533989: (:Instauser {name: '289533989'}),\n",
       " 216276523: (:Instauser {name: '216276523'}),\n",
       " 201636909: (:Instauser {name: '201636909'}),\n",
       " 345714223: (:Instauser {name: '345714223'}),\n",
       " 44762674: (:Instauser {name: '44762674'}),\n",
       " 1275825203: (:Instauser {name: '1275825203'}),\n",
       " 233006644: (:Instauser {name: '233006644'}),\n",
       " 2159717428: (:Instauser {name: '2159717428'}),\n",
       " 1273815094: (:Instauser {name: '1273815094'}),\n",
       " 1445689400: (:Instauser {name: '1445689400'}),\n",
       " 553909309: (:Instauser {name: '553909309'}),\n",
       " 33467972: (:Instauser {name: '33467972'}),\n",
       " 1706678344: (:Instauser {name: '1706678344'}),\n",
       " 35301449: (:Instauser {name: '35301449'}),\n",
       " 261211211: (:Instauser {name: '261211211'}),\n",
       " 10996812: (:Instauser {name: '10996812'}),\n",
       " 10608211: (:Instauser {name: '10608211'}),\n",
       " 176412243: (:Instauser {name: '176412243'}),\n",
       " 247381590: (:Instauser {name: '247381590'}),\n",
       " 194841177: (:Instauser {name: '194841177'}),\n",
       " 49790041: (:Instauser {name: '49790041'}),\n",
       " 2319176281: (:Instauser {name: '2319176281'}),\n",
       " 1133629024: (:Instauser {name: '1133629024'}),\n",
       " 53854304: (:Instauser {name: '53854304'}),\n",
       " 1791180388: (:Instauser {name: '1791180388'}),\n",
       " 691113979: (:Instauser {name: '691113979'}),\n",
       " 198953576: (:Instauser {name: '198953576'}),\n",
       " 26642027: (:Instauser {name: '26642027'}),\n",
       " 258898539: (:Instauser {name: '258898539'}),\n",
       " 197705325: (:Instauser {name: '197705325'}),\n",
       " 184920685: (:Instauser {name: '184920685'}),\n",
       " 3633081453: (:Instauser {name: '3633081453'}),\n",
       " 273320045: (:Instauser {name: '273320045'}),\n",
       " 35002994: (:Instauser {name: '35002994'}),\n",
       " 53712493: (:Instauser {name: '53712493'}),\n",
       " 6038273652: (:Instauser {name: '6038273652'}),\n",
       " 5463510643: (:Instauser {name: '5463510643'}),\n",
       " 1764754549: (:Instauser {name: '1764754549'}),\n",
       " 2081357942: (:Instauser {name: '2081357942'}),\n",
       " 187428986: (:Instauser {name: '187428986'}),\n",
       " 145347706: (:Instauser {name: '145347706'}),\n",
       " 204521601: (:Instauser {name: '204521601'}),\n",
       " 263254147: (:Instauser {name: '263254147'}),\n",
       " 321981574: (:Instauser {name: '321981574'}),\n",
       " 1516960903: (:Instauser {name: '1516960903'}),\n",
       " 265222281: (:Instauser {name: '265222281'}),\n",
       " 194677386: (:Instauser {name: '194677386'}),\n",
       " 695699083: (:Instauser {name: '695699083'}),\n",
       " 3530036370: (:Instauser {name: '3530036370'}),\n",
       " 397014674: (:Instauser {name: '397014674'}),\n",
       " 224641685: (:Instauser {name: '224641685'}),\n",
       " 1329260695: (:Instauser {name: '1329260695'}),\n",
       " 40819869: (:Instauser {name: '40819869'}),\n",
       " 273624226: (:Instauser {name: '273624226'}),\n",
       " 379355298: (:Instauser {name: '379355298'}),\n",
       " 9344677: (:Instauser {name: '9344677'}),\n",
       " 2066080425: (:Instauser {name: '2066080425'}),\n",
       " 4294116523: (:Instauser {name: '4294116523'}),\n",
       " 1454309549: (:Instauser {name: '1454309549'}),\n",
       " 4518129839: (:Instauser {name: '4518129839'}),\n",
       " 657851056: (:Instauser {name: '657851056'}),\n",
       " 224727219: (:Instauser {name: '224727219'}),\n",
       " 5348352689: (:Instauser {name: '5348352689'}),\n",
       " 46171322: (:Instauser {name: '46171322'}),\n",
       " 1507464381: (:Instauser {name: '1507464381'}),\n",
       " 593329341: (:Instauser {name: '593329341'}),\n",
       " 178922174: (:Instauser {name: '178922174'}),\n",
       " 1290975936: (:Instauser {name: '1290975936'}),\n",
       " 203429056: (:Instauser {name: '203429056'}),\n",
       " 229826762: (:Instauser {name: '229826762'}),\n",
       " 4371011275: (:Instauser {name: '4371011275'}),\n",
       " 289159372: (:Instauser {name: '289159372'}),\n",
       " 3123941580: (:Instauser {name: '3123941580'}),\n",
       " 176952523: (:Instauser {name: '176952523'}),\n",
       " 2209910475: (:Instauser {name: '2209910475'}),\n",
       " 6395975889: (:Instauser {name: '6395975889'}),\n",
       " 1131672780: (:Instauser {name: '1131672780'}),\n",
       " 726667988: (:Instauser {name: '726667988'}),\n",
       " 42251990: (:Instauser {name: '42251990'}),\n",
       " 221160662: (:Instauser {name: '221160662'}),\n",
       " 1943630552: (:Instauser {name: '1943630552'}),\n",
       " 4011521756: (:Instauser {name: '4011521756'}),\n",
       " 245275356: (:Instauser {name: '245275356'}),\n",
       " 2020220639: (:Instauser {name: '2020220639'}),\n",
       " 1785976033: (:Instauser {name: '1785976033'}),\n",
       " 216732901: (:Instauser {name: '216732901'}),\n",
       " 446175977: (:Instauser {name: '446175977'}),\n",
       " 262289131: (:Instauser {name: '262289131'}),\n",
       " 3714145514: (:Instauser {name: '3714145514'}),\n",
       " 506188015: (:Instauser {name: '506188015'}),\n",
       " 292127989: (:Instauser {name: '292127989'}),\n",
       " 191734517: (:Instauser {name: '191734517'}),\n",
       " 40656629: (:Instauser {name: '40656629'}),\n",
       " 841360634: (:Instauser {name: '841360634'}),\n",
       " 233099515: (:Instauser {name: '233099515'}),\n",
       " 5535971580: (:Instauser {name: '5535971580'}),\n",
       " 313200893: (:Instauser {name: '313200893'}),\n",
       " 2318175485: (:Instauser {name: '2318175485'}),\n",
       " 4155441409: (:Instauser {name: '4155441409'}),\n",
       " 40238337: (:Instauser {name: '40238337'}),\n",
       " 298750211: (:Instauser {name: '298750211'}),\n",
       " 818023170: (:Instauser {name: '818023170'}),\n",
       " 297627397: (:Instauser {name: '297627397'}),\n",
       " 217884423: (:Instauser {name: '217884423'}),\n",
       " 282321163: (:Instauser {name: '282321163'}),\n",
       " 199371022: (:Instauser {name: '199371022'}),\n",
       " 40589069: (:Instauser {name: '40589069'}),\n",
       " 255777038: (:Instauser {name: '255777038'}),\n",
       " 191690515: (:Instauser {name: '191690515'}),\n",
       " 5135637: (:Instauser {name: '5135637'}),\n",
       " 5804525336: (:Instauser {name: '5804525336'}),\n",
       " 3239987997: (:Instauser {name: '3239987997'}),\n",
       " 4097309: (:Instauser {name: '4097309'}),\n",
       " 260458782: (:Instauser {name: '260458782'}),\n",
       " 1125138727: (:Instauser {name: '1125138727'}),\n",
       " 335399208: (:Instauser {name: '335399208'}),\n",
       " 10212135: (:Instauser {name: '10212135'}),\n",
       " 2031758127: (:Instauser {name: '2031758127'}),\n",
       " 5745525045: (:Instauser {name: '5745525045'}),\n",
       " 1386806: (:Instauser {name: '1386806'}),\n",
       " 208401720: (:Instauser {name: '208401720'}),\n",
       " 20676921: (:Instauser {name: '20676921'}),\n",
       " 189409081: (:Instauser {name: '189409081'}),\n",
       " 1430137659: (:Instauser {name: '1430137659'}),\n",
       " 193553214: (:Instauser {name: '193553214'}),\n",
       " 276266303: (:Instauser {name: '276266303'}),\n",
       " 196777791: (:Instauser {name: '196777791'}),\n",
       " 243188546: (:Instauser {name: '243188546'}),\n",
       " 6703207747: (:Instauser {name: '6703207747'}),\n",
       " 190332740: (:Instauser {name: '190332740'}),\n",
       " 381781316: (:Instauser {name: '381781316'}),\n",
       " 594167623: (:Instauser {name: '594167623'}),\n",
       " 258801992: (:Instauser {name: '258801992'}),\n",
       " 332129099: (:Instauser {name: '332129099'}),\n",
       " 1306577230: (:Instauser {name: '1306577230'}),\n",
       " 32566092: (:Instauser {name: '32566092'}),\n",
       " 5527061840: (:Instauser {name: '5527061840'}),\n",
       " 4125520: (:Instauser {name: '4125520'}),\n",
       " 709015380: (:Instauser {name: '709015380'}),\n",
       " 630984024: (:Instauser {name: '630984024'}),\n",
       " 463543129: (:Instauser {name: '463543129'}),\n",
       " 54352732: (:Instauser {name: '54352732'}),\n",
       " 42200412: (:Instauser {name: '42200412'}),\n",
       " 1761115487: (:Instauser {name: '1761115487'}),\n",
       " 298846562: (:Instauser {name: '298846562'}),\n",
       " 241055075: (:Instauser {name: '241055075'}),\n",
       " 1211288932: (:Instauser {name: '1211288932'}),\n",
       " 1328408933: (:Instauser {name: '1328408933'}),\n",
       " 371943273: (:Instauser {name: '371943273'}),\n",
       " 1684237161: (:Instauser {name: '1684237161'}),\n",
       " 186142574: (:Instauser {name: '186142574'}),\n",
       " 1615837553: (:Instauser {name: '1615837553'}),\n",
       " 174792052: (:Instauser {name: '174792052'}),\n",
       " 24319358: (:Instauser {name: '24319358'}),\n",
       " 1652423552: (:Instauser {name: '1652423552'}),\n",
       " 181320576: (:Instauser {name: '181320576'}),\n",
       " 449726851: (:Instauser {name: '449726851'}),\n",
       " 143553924: (:Instauser {name: '143553924'}),\n",
       " 356403077: (:Instauser {name: '356403077'}),\n",
       " 1326155651: (:Instauser {name: '1326155651'}),\n",
       " 5530854796: (:Instauser {name: '5530854796'}),\n",
       " 1460303247: (:Instauser {name: '1460303247'}),\n",
       " 217903508: (:Instauser {name: '217903508'}),\n",
       " 1435956629: (:Instauser {name: '1435956629'}),\n",
       " 239797144: (:Instauser {name: '239797144'}),\n",
       " 3995324314: (:Instauser {name: '3995324314'}),\n",
       " 205725601: (:Instauser {name: '205725601'}),\n",
       " 378664954: (:Instauser {name: '378664954'}),\n",
       " 21902845: (:Instauser {name: '21902845'}),\n",
       " 358040994: (:Instauser {name: '358040994'}),\n",
       " 178694569: (:Instauser {name: '178694569'}),\n",
       " 1544976812: (:Instauser {name: '1544976812'}),\n",
       " 619211180: (:Instauser {name: '619211180'}),\n",
       " 605356465: (:Instauser {name: '605356465'}),\n",
       " 41990581: (:Instauser {name: '41990581'}),\n",
       " 4050764727: (:Instauser {name: '4050764727'}),\n",
       " 3902135746: (:Instauser {name: '3902135746'}),\n",
       " 5830275015: (:Instauser {name: '5830275015'}),\n",
       " 3236355017: (:Instauser {name: '3236355017'}),\n",
       " 222707661: (:Instauser {name: '222707661'}),\n",
       " 460658129: (:Instauser {name: '460658129'}),\n",
       " 46495697: (:Instauser {name: '46495697'}),\n",
       " 410680276: (:Instauser {name: '410680276'}),\n",
       " 264458709: (:Instauser {name: '264458709'}),\n",
       " 179698646: (:Instauser {name: '179698646'}),\n",
       " 270923736: (:Instauser {name: '270923736'}),\n",
       " 5746309082: (:Instauser {name: '5746309082'}),\n",
       " 15604699: (:Instauser {name: '15604699'}),\n",
       " 37529054: (:Instauser {name: '37529054'}),\n",
       " 1437281246: (:Instauser {name: '1437281246'}),\n",
       " 369550818: (:Instauser {name: '369550818'}),\n",
       " 44637667: (:Instauser {name: '44637667'}),\n",
       " 5870391779: (:Instauser {name: '5870391779'}),\n",
       " 213218789: (:Instauser {name: '213218789'}),\n",
       " 191024106: (:Instauser {name: '191024106'}),\n",
       " 49754089: (:Instauser {name: '49754089'}),\n",
       " 21724141: (:Instauser {name: '21724141'}),\n",
       " 1736663022: (:Instauser {name: '1736663022'}),\n",
       " 3882089453: (:Instauser {name: '3882089453'}),\n",
       " 194753005: (:Instauser {name: '194753005'}),\n",
       " 2264177654: (:Instauser {name: '2264177654'}),\n",
       " 6202264057: (:Instauser {name: '6202264057'}),\n",
       " 4169939967: (:Instauser {name: '4169939967'}),\n",
       " 6180933646: (:Instauser {name: '6180933646'}),\n",
       " 4875892247: (:Instauser {name: '4875892247'}),\n",
       " 1922874404: (:Instauser {name: '1922874404'}),\n",
       " 3966416428: (:Instauser {name: '3966416428'}),\n",
       " 745667120: (:Instauser {name: '745667120'}),\n",
       " 44439090: (:Instauser {name: '44439090'}),\n",
       " 2100231246: (:Instauser {name: '2100231246'}),\n",
       " 6507821135: (:Instauser {name: '6507821135'}),\n",
       " 2161777235: (:Instauser {name: '2161777235'}),\n",
       " 26800731: (:Instauser {name: '26800731'}),\n",
       " 5681575013: (:Instauser {name: '5681575013'}),\n",
       " 3004266097: (:Instauser {name: '3004266097'}),\n",
       " 2074931323: (:Instauser {name: '2074931323'}),\n",
       " 2202586749: (:Instauser {name: '2202586749'}),\n",
       " 182849675: (:Instauser {name: '182849675'}),\n",
       " 1710007952: (:Instauser {name: '1710007952'}),\n",
       " 3148998290: (:Instauser {name: '3148998290'}),\n",
       " 3980919956: (:Instauser {name: '3980919956'}),\n",
       " 2262060185: (:Instauser {name: '2262060185'}),\n",
       " 2911430824: (:Instauser {name: '2911430824'}),\n",
       " 1490110122: (:Instauser {name: '1490110122'}),\n",
       " 251588778: (:Instauser {name: '251588778'}),\n",
       " 4212508857: (:Instauser {name: '4212508857'}),\n",
       " 212940996: (:Instauser {name: '212940996'}),\n",
       " 1993904842: (:Instauser {name: '1993904842'}),\n",
       " 3039345894: (:Instauser {name: '3039345894'}),\n",
       " 213752561: (:Instauser {name: '213752561'}),\n",
       " 2035906291: (:Instauser {name: '2035906291'}),\n",
       " 1073503991: (:Instauser {name: '1073503991'}),\n",
       " 12422917: (:Instauser {name: '12422917'}),\n",
       " 2043423495: (:Instauser {name: '2043423495'}),\n",
       " 6535863048: (:Instauser {name: '6535863048'}),\n",
       " 5492370697: (:Instauser {name: '5492370697'}),\n",
       " 606406414: (:Instauser {name: '606406414'}),\n",
       " 5990730510: (:Instauser {name: '5990730510'}),\n",
       " 3128705304: (:Instauser {name: '3128705304'}),\n",
       " 5709658913: (:Instauser {name: '5709658913'}),\n",
       " 4636470567: (:Instauser {name: '4636470567'}),\n",
       " 40324904: (:Instauser {name: '40324904'}),\n",
       " 54524735: (:Instauser {name: '54524735'}),\n",
       " 36496723: (:Instauser {name: '36496723'}),\n",
       " 5910474072: (:Instauser {name: '5910474072'}),\n",
       " 4679198554: (:Instauser {name: '4679198554'}),\n",
       " 490871140: (:Instauser {name: '490871140'}),\n",
       " 312060774: (:Instauser {name: '312060774'}),\n",
       " 3468235138: (:Instauser {name: '3468235138'}),\n",
       " 1837068680: (:Instauser {name: '1837068680'}),\n",
       " 885467533: (:Instauser {name: '885467533'}),\n",
       " 3637821838: (:Instauser {name: '3637821838'}),\n",
       " 4177249171: (:Instauser {name: '4177249171'}),\n",
       " 4325232533: (:Instauser {name: '4325232533'}),\n",
       " 42152355: (:Instauser {name: '42152355'}),\n",
       " 188901812: (:Instauser {name: '188901812'}),\n",
       " 482236341: (:Instauser {name: '482236341'}),\n",
       " 357543354: (:Instauser {name: '357543354'}),\n",
       " 1488660938: (:Instauser {name: '1488660938'}),\n",
       " 46720978: (:Instauser {name: '46720978'}),\n",
       " 1364725717: (:Instauser {name: '1364725717'}),\n",
       " 1587642859: (:Instauser {name: '1587642859'}),\n",
       " 53756913: (:Instauser {name: '53756913'}),\n",
       " 14400502: (:Instauser {name: '14400502'}),\n",
       " 46191632: (:Instauser {name: '46191632'}),\n",
       " 52388893: (:Instauser {name: '52388893'}),\n",
       " 3102683683: (:Instauser {name: '3102683683'}),\n",
       " 32491070: (:Instauser {name: '32491070'}),\n",
       " 277227597: (:Instauser {name: '277227597'}),\n",
       " 4090792529: (:Instauser {name: '4090792529'}),\n",
       " 5879275619: (:Instauser {name: '5879275619'}),\n",
       " 4727728743: (:Instauser {name: '4727728743'}),\n",
       " 22592617: (:Instauser {name: '22592617'}),\n",
       " 178943086: (:Instauser {name: '178943086'}),\n",
       " 208180339: (:Instauser {name: '208180339'}),\n",
       " 4192365683: (:Instauser {name: '4192365683'}),\n",
       " 201180799: (:Instauser {name: '201180799'}),\n",
       " 1024239760: (:Instauser {name: '1024239760'}),\n",
       " 23823511: (:Instauser {name: '23823511'}),\n",
       " 291314848: (:Instauser {name: '291314848'}),\n",
       " 2569967265: (:Instauser {name: '2569967265'}),\n",
       " 336220340: (:Instauser {name: '336220340'}),\n",
       " 1441173687: (:Instauser {name: '1441173687'}),\n",
       " 360582849: (:Instauser {name: '360582849'}),\n",
       " 9337541: (:Instauser {name: '9337541'}),\n",
       " 4147978439: (:Instauser {name: '4147978439'}),\n",
       " 2015113440: (:Instauser {name: '2015113440'}),\n",
       " 211730155: (:Instauser {name: '211730155'}),\n",
       " 306311922: (:Instauser {name: '306311922'}),\n",
       " 4927912190: (:Instauser {name: '4927912190'}),\n",
       " 52739342: (:Instauser {name: '52739342'}),\n",
       " 190435091: (:Instauser {name: '190435091'}),\n",
       " 5514834711: (:Instauser {name: '5514834711'}),\n",
       " 3034172188: (:Instauser {name: '3034172188'}),\n",
       " 7856422: (:Instauser {name: '7856422'}),\n",
       " 509328679: (:Instauser {name: '509328679'}),\n",
       " 1991209284: (:Instauser {name: '1991209284'}),\n",
       " 593620808: (:Instauser {name: '593620808'}),\n",
       " 201399627: (:Instauser {name: '201399627'}),\n",
       " 196716378: (:Instauser {name: '196716378'}),\n",
       " 208370535: (:Instauser {name: '208370535'}),\n",
       " 174550895: (:Instauser {name: '174550895'}),\n",
       " 242471798: (:Instauser {name: '242471798'}),\n",
       " 184433027: (:Instauser {name: '184433027'}),\n",
       " 6119860099: (:Instauser {name: '6119860099'}),\n",
       " 2964382601: (:Instauser {name: '2964382601'}),\n",
       " 48346515: (:Instauser {name: '48346515'}),\n",
       " 2205139350: (:Instauser {name: '2205139350'}),\n",
       " 260074915: (:Instauser {name: '260074915'}),\n",
       " 3995671972: (:Instauser {name: '3995671972'}),\n",
       " 9344935: (:Instauser {name: '9344935'}),\n",
       " 320721316: (:Instauser {name: '320721316'}),\n",
       " 39721897: (:Instauser {name: '39721897'}),\n",
       " 1218333123: (:Instauser {name: '1218333123'}),\n",
       " 25499609: (:Instauser {name: '25499609'}),\n",
       " 5430225885: (:Instauser {name: '5430225885'}),\n",
       " 42732007: (:Instauser {name: '42732007'}),\n",
       " 5101188080: (:Instauser {name: '5101188080'}),\n",
       " 1146885623: (:Instauser {name: '1146885623'}),\n",
       " 4059301889: (:Instauser {name: '4059301889'}),\n",
       " 6326795788: (:Instauser {name: '6326795788'}),\n",
       " 51644944: (:Instauser {name: '51644944'}),\n",
       " 3038247955: (:Instauser {name: '3038247955'}),\n",
       " 13153811: (:Instauser {name: '13153811'}),\n",
       " 738635283: (:Instauser {name: '738635283'}),\n",
       " 37660197: (:Instauser {name: '37660197'}),\n",
       " 4145206829: (:Instauser {name: '4145206829'}),\n",
       " 1128218680: (:Instauser {name: '1128218680'}),\n",
       " 258112585: (:Instauser {name: '258112585'}),\n",
       " 716115532: (:Instauser {name: '716115532'}),\n",
       " 1224086608: (:Instauser {name: '1224086608'}),\n",
       " 213433959: (:Instauser {name: '213433959'}),\n",
       " 5449755760: (:Instauser {name: '5449755760'}),\n",
       " 1522853493: (:Instauser {name: '1522853493'}),\n",
       " 335192186: (:Instauser {name: '335192186'}),\n",
       " 5356837506: (:Instauser {name: '5356837506'}),\n",
       " 4017622658: (:Instauser {name: '4017622658'}),\n",
       " 1649614479: (:Instauser {name: '1649614479'}),\n",
       " 3540402324: (:Instauser {name: '3540402324'}),\n",
       " 4229229729: (:Instauser {name: '4229229729'}),\n",
       " 2257398439: (:Instauser {name: '2257398439'}),\n",
       " 2948327080: (:Instauser {name: '2948327080'}),\n",
       " 3667922602: (:Instauser {name: '3667922602'}),\n",
       " 5326369967: (:Instauser {name: '5326369967'}),\n",
       " 203175100: (:Instauser {name: '203175100'}),\n",
       " 4374526660: (:Instauser {name: '4374526660'}),\n",
       " 1700880585: (:Instauser {name: '1700880585'}),\n",
       " 277841100: (:Instauser {name: '277841100'}),\n",
       " 385755853: (:Instauser {name: '385755853'}),\n",
       " 4158431955: (:Instauser {name: '4158431955'}),\n",
       " 5887993571: (:Instauser {name: '5887993571'}),\n",
       " 283720452: (:Instauser {name: '283720452'}),\n",
       " 226404620: (:Instauser {name: '226404620'}),\n",
       " 648831761: (:Instauser {name: '648831761'}),\n",
       " 12008742: (:Instauser {name: '12008742'}),\n",
       " 54506805: (:Instauser {name: '54506805'}),\n",
       " 25320765: (:Instauser {name: '25320765'}),\n",
       " 5367103810: (:Instauser {name: '5367103810'}),\n",
       " 5735554375: (:Instauser {name: '5735554375'}),\n",
       " 265901907: (:Instauser {name: '265901907'}),\n",
       " 258301782: (:Instauser {name: '258301782'}),\n",
       " 4567813462: (:Instauser {name: '4567813462'}),\n",
       " 1073841001: (:Instauser {name: '1073841001'}),\n",
       " 1612548469: (:Instauser {name: '1612548469'}),\n",
       " 4231485813: (:Instauser {name: '4231485813'}),\n",
       " 4098291614: (:Instauser {name: '4098291614'}),\n",
       " 259032994: (:Instauser {name: '259032994'}),\n",
       " 247097271: (:Instauser {name: '247097271'}),\n",
       " 1790530998: (:Instauser {name: '1790530998'}),\n",
       " 5666945980: (:Instauser {name: '5666945980'}),\n",
       " 2781640: (:Instauser {name: '2781640'}),\n",
       " 1528014803: (:Instauser {name: '1528014803'}),\n",
       " 4474549214: (:Instauser {name: '4474549214'}),\n",
       " 8736755: (:Instauser {name: '8736755'}),\n",
       " 4507102205: (:Instauser {name: '4507102205'}),\n",
       " 5678386696: (:Instauser {name: '5678386696'}),\n",
       " 2067539530: (:Instauser {name: '2067539530'}),\n",
       " 240518274: (:Instauser {name: '240518274'}),\n",
       " 299255812: (:Instauser {name: '299255812'}),\n",
       " 2031248267: (:Instauser {name: '2031248267'}),\n",
       " 440342671: (:Instauser {name: '440342671'}),\n",
       " 3197167772: (:Instauser {name: '3197167772'}),\n",
       " 6337271963: (:Instauser {name: '6337271963'}),\n",
       " 4519535266: (:Instauser {name: '4519535266'}),\n",
       " 6570559524: (:Instauser {name: '6570559524'}),\n",
       " 34261033: (:Instauser {name: '34261033'}),\n",
       " 2440466474: (:Instauser {name: '2440466474'}),\n",
       " 3190802607: (:Instauser {name: '3190802607'}),\n",
       " 4139355825: (:Instauser {name: '4139355825'}),\n",
       " 6427581617: (:Instauser {name: '6427581617'}),\n",
       " 1735362685: (:Instauser {name: '1735362685'}),\n",
       " 5516474307: (:Instauser {name: '5516474307'}),\n",
       " 5870576705: (:Instauser {name: '5870576705'}),\n",
       " 2941956041: (:Instauser {name: '2941956041'}),\n",
       " 33864905: (:Instauser {name: '33864905'}),\n",
       " 6215067090: (:Instauser {name: '6215067090'}),\n",
       " 6204963166: (:Instauser {name: '6204963166'}),\n",
       " 1444523747: (:Instauser {name: '1444523747'}),\n",
       " 1256892649: (:Instauser {name: '1256892649'}),\n",
       " 6060937213: (:Instauser {name: '6060937213'}),\n",
       " 1541230: (:Instauser {name: '1541230'}),\n",
       " 211623542: (:Instauser {name: '211623542'}),\n",
       " 329289335: (:Instauser {name: '329289335'}),\n",
       " 3034169722: (:Instauser {name: '3034169722'}),\n",
       " 6378759681: (:Instauser {name: '6378759681'}),\n",
       " 1017349: (:Instauser {name: '1017349'}),\n",
       " 199335947: (:Instauser {name: '199335947'}),\n",
       " 174644238: (:Instauser {name: '174644238'}),\n",
       " 234871327: (:Instauser {name: '234871327'}),\n",
       " 1978400808: (:Instauser {name: '1978400808'}),\n",
       " 5705136681: (:Instauser {name: '5705136681'}),\n",
       " 689067563: (:Instauser {name: '689067563'}),\n",
       " 2165283383: (:Instauser {name: '2165283383'}),\n",
       " 865215563: (:Instauser {name: '865215563'}),\n",
       " 177327692: (:Instauser {name: '177327692'}),\n",
       " 1618919003: (:Instauser {name: '1618919003'}),\n",
       " 6564915832: (:Instauser {name: '6564915832'}),\n",
       " 3539328142: (:Instauser {name: '3539328142'}),\n",
       " 3652611217: (:Instauser {name: '3652611217'}),\n",
       " 788010131: (:Instauser {name: '788010131'}),\n",
       " 2174839963: (:Instauser {name: '2174839963'}),\n",
       " 1578018986: (:Instauser {name: '1578018986'}),\n",
       " 17929908: (:Instauser {name: '17929908'}),\n",
       " 196449461: (:Instauser {name: '196449461'}),\n",
       " 2928127190: (:Instauser {name: '2928127190'}),\n",
       " 5840777436: (:Instauser {name: '5840777436'}),\n",
       " 218922207: (:Instauser {name: '218922207'}),\n",
       " 4284557044: (:Instauser {name: '4284557044'}),\n",
       " 56012021: (:Instauser {name: '56012021'}),\n",
       " 175021302: (:Instauser {name: '175021302'}),\n",
       " 6018985211: (:Instauser {name: '6018985211'}),\n",
       " 209817853: (:Instauser {name: '209817853'}),\n",
       " 104843011: (:Instauser {name: '104843011'}),\n",
       " 1836909835: (:Instauser {name: '1836909835'}),\n",
       " 517633295: (:Instauser {name: '517633295'}),\n",
       " 6208510229: (:Instauser {name: '6208510229'}),\n",
       " 181683480: (:Instauser {name: '181683480'}),\n",
       " 5877226786: (:Instauser {name: '5877226786'}),\n",
       " 3046941987: (:Instauser {name: '3046941987'}),\n",
       " 216300837: (:Instauser {name: '216300837'}),\n",
       " 1445492014: (:Instauser {name: '1445492014'}),\n",
       " 4212595010: (:Instauser {name: '4212595010'}),\n",
       " 52905795: (:Instauser {name: '52905795'}),\n",
       " 6211856197: (:Instauser {name: '6211856197'}),\n",
       " 1819334484: (:Instauser {name: '1819334484'}),\n",
       " 49518421: (:Instauser {name: '49518421'}),\n",
       " 4035782997: (:Instauser {name: '4035782997'}),\n",
       " 4937703773: (:Instauser {name: '4937703773'}),\n",
       " 5931000672: (:Instauser {name: '5931000672'}),\n",
       " 190948197: (:Instauser {name: '190948197'}),\n",
       " 2208884069: (:Instauser {name: '2208884069'}),\n",
       " 1187962217: (:Instauser {name: '1187962217'}),\n",
       " 4814395769: (:Instauser {name: '4814395769'}),\n",
       " 502765436: (:Instauser {name: '502765436'}),\n",
       " 3088817025: (:Instauser {name: '3088817025'}),\n",
       " 1229319554: (:Instauser {name: '1229319554'}),\n",
       " 2262834052: (:Instauser {name: '2262834052'}),\n",
       " 1444937610: (:Instauser {name: '1444937610'}),\n",
       " 16508822: (:Instauser {name: '16508822'}),\n",
       " 2285050274: (:Instauser {name: '2285050274'}),\n",
       " 2125903781: (:Instauser {name: '2125903781'}),\n",
       " ...}"
      ]
     },
     "execution_count": 178,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 171,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "537569\n",
      "247447041\n",
      "221684260\n",
      "213951333\n",
      "316236037\n",
      "222306121\n",
      "256829035\n",
      "243203979\n",
      "995045100\n",
      "1032051758\n"
     ]
    }
   ],
   "source": [
    "for l in data[:10]:\n",
    "    print(l['name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "sys.path.append('/home/epfl/ftp/insta-network/src')\n",
    "\n",
    "from GraphDatabase import Database\n",
    "db = Database()\n",
    "graph = db.get_community(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 200,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "db.get_community(root_community)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
